[{"permalink":"https://www.reddit.com/r/reddit.com/comments/l9wuw/remember_that_jailbait_thread_with_users_begging/?limit=500"},{"date":"Wed Oct 12 19:37:18 2011 UTC","comments":"See that, people? <em>That<\/em> is trolling. Your friend drawing a mustache on your CD-case? That&#39;s called a &quot;prank&quot; or a &quot;joke&quot;. Getting one of the busiest parts of a website shut-down because of manufactured perverseness? That&#39;s gold.\nBravo.","author":"JesusWasABlackMan"},{"date":"Wed Oct 12 23:35:34 2011 UTC","comments":"I&#39;m glad at least one person on here still knows what trolling is.","author":"SantiagoRamon"},{"date":"Wed Oct 12 23:46:14 2011 UTC","comments":"Nice troll lol.","author":"asherrd"},{"date":"Thu Oct 13 00:59:42 2011 UTC","comments":"You laughed at him? Oh my god, you are such a troll! ","author":"RestoreFear"},{"date":"Thu Oct 13 01:35:24 2011 UTC","comments":"You&#39;re a 20 foot monster with large claws and spectacular regenerative properties?  Oh my god, you are such a troll!","author":"slyguy183"},{"date":"Thu Oct 13 08:14:24 2011 UTC","comments":"you&#39;re a half foot nude eunuch with bright pink hair? you are such a troll!","author":"doot_doot"},{"date":"Thu Oct 13 10:26:25 2011 UTC","comments":"You&#39;re the 19th century Austrian architect who designed the St. Anton Church in Vienna? God, you&#39;re such a Troll!","author":"rainbow_fairy"},{"date":"Thu Oct 13 18:18:57 2011 UTC","comments":"You&#39;re a German gummy candy manufacturer? Golly, you&#39;re such a Trolli!","author":"shiner_bock"},{"date":"Thu Oct 13 12:15:39 2011 UTC","comments":"Why <em>do<\/em> trolls always have regenerative powers in fiction? Is there some Norse legend I&#39;m missing out on?","author":"TheAwesomatorist"},{"date":"Thu Oct 13 13:34:49 2011 UTC","comments":"It&#39;s from Poul Anderson&#39;s <em><a href=\"http://en.wikipedia.org/wiki/Three_Hearts_and_Three_Lions\" rel=\"nofollow\">Three Hearts and Three Lions<\/a><\/em>. The main character, Holger Carlsen, is also the inspiration for the Paladin, and the alignment system from Dungeons and Dragons was derived from the book, as well.","author":"tremens"},{"date":"Thu Oct 13 01:23:52 2011 UTC","comments":"What if it&#39;s some sort of meta-troll by <a href=\"/r/jailbait\">r/jailbait<\/a> to get itself re-legitimised?","author":"Chadwag"},{"date":"Thu Oct 13 03:40:32 2011 UTC","comments":"<a href=\"/r/jailbait\" rel=\"nofollow\">/r/jailbait<\/a> was <em>one of the busiest parts of reddit!?!?!?<\/em>\nI&#39;m going to go and wallow in a physical pool of naïveté","author":"woodledoodledoodle"},{"date":"Thu Oct 13 11:08:48 2011 UTC","comments":"Try searching &quot;Reddit&quot; on Google.","author":"AtomicDog1471"},{"date":"Thu Oct 13 00:15:14 2011 UTC","comments":"thats not trolling, i dont see a trollface.jpg anywhere on that thread","author":"d4rkhorizoN"},{"date":"Thu Oct 13 01:05:18 2011 UTC","comments":"u mad?","author":"woohoo"},{"date":"Thu Oct 13 00:39:59 2011 UTC","comments":"the hook may have been manufactured, but the fish that fought to get on it were real","author":"tiffany43"},{"date":"Thu Oct 13 01:28:48 2011 UTC","comments":"Who says the &quot;PM&quot; rush wasn&#39;t almost entirely SA goons? In fact, I&#39;d suspect it was, since it was so out of character for the subreddit.","author":"MacEnvy"},{"date":"Thu Oct 13 06:26:08 2011 UTC","comments":"Joking, of course.","author":"solidsharkey"},{"date":"Wed Oct 12 23:48:46 2011 UTC","comments":"I think there was already perverseness in an image board full of photos of sexualized minors.","author":"xroot"},{"date":"Wed Oct 12 23:56:33 2011 UTC","comments":"You don&#39;t need to sexualize minors. They do it on their own. Mmmmm sexy sexy minors. ","author":"Karmaisforsuckers"},{"date":"Thu Oct 13 00:23:26 2011 UTC","comments":"Of course they&#39;re sexy, what with those bulging muscles and hardhats.","author":"tomrhod"},{"date":"Thu Oct 13 05:24:12 2011 UTC","comments":"...black lung just turns me on....","author":"ruptured_pomposity"},{"date":"Thu Oct 13 01:44:33 2011 UTC","comments":"<a href=\"http://www.youtube.com/watch?v=HXzkv8X9UkQ#t=134s\">Minors, not miners!<\/a>","author":"Dejh"},{"date":"Thu Oct 13 00:13:36 2011 UTC","comments":"not helping","author":"endline80"},{"date":"Thu Oct 13 01:52:33 2011 UTC","comments":"I mean I guess you could call it trolling but did they manufacture the demand for child pornography?  No.  It was already there.  Sort of just exposed it in a very public way.  ","author":"bonerina"},{"date":"Thu Oct 13 02:26:36 2011 UTC","comments":"Wait, why was my initial reaction one of disgust and annoyance? I fucking hated <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a>!","author":"Black_Apalachi"},{"date":"Thu Oct 13 02:28:30 2011 UTC","comments":"I&#39;m pretty sure they didn&#39;t manufacture perverseness so much as expose it.\nI mean, and correct me if I&#39;m wrong, but wasn&#39;t the whole purpose of <a href=\"/r/jailbait\">r/jailbait<\/a> was so that guys could jack off to pictures of underage girls?  That&#39;s pretty much the definition of perverse.","author":"Rainbowsareghey"},{"date":"Wed Oct 12 23:49:57 2011 UTC","comments":"Manufactured? Dude, it was a salacious pic of a 14 yr old.","author":"crusoe"},{"date":"Wed Oct 12 23:56:05 2011 UTC","comments":"The people asking for nudes were the manufactured part. Those were Goons coming in doing it on purpose.","author":"WarPhalange"},{"date":"Thu Oct 13 00:40:35 2011 UTC","comments":"Am I missing the part in the thread where this was revealed to be staged? It seems to me those who were asking for CP to be PMed to them (in an effort to evade the rules) could have very well have been legitimate requests.\nTo me what seemed to be the last straw was this: the mods did not remove the &#39;PM me the CP&#39; requests until many hours had passed, revealing a big flaw in moderation, which put Reddit at risk for an FBI raid. So the powers that be decided that the moderators were not providing enough protection, and down it went. Bottom line: if the mods acted more swiftly the subreddit may still exist today.","author":"Calexica"},{"date":"Thu Oct 13 01:09:27 2011 UTC","comments":"Am I missing the part in the thread where this was revealed to be staged?\nNope. That never happened.","author":"AlyoshaV"},{"date":"Thu Oct 13 02:03:46 2011 UTC","comments":"This is entirely bullshit. SA has had legal trouble over raids. The mods shut down <strong><em>anything<\/em><\/strong> even resembling a raid before it even starts.  Just fucking pedophiles complaining.","author":"lop987"},{"date":"Thu Oct 13 02:23:35 2011 UTC","comments":"Ephebophiles, not pedophiles. ","author":"facebookcreepin"},{"date":"Thu Oct 13 08:06:11 2011 UTC","comments":"Sssssh. This is not a subreddit we need.","author":"Wordwench"},{"date":"Fri Oct 14 02:34:57 2011 UTC","comments":"Finding post pubescent boys/girls attractive is the trait of an ephebophile, not a pedophile. This isn&#39;t a matter of defending anyone, it&#39;s a matter of getting your argument straight. ","author":"facebookcreepin"},{"date":"Thu Oct 13 13:25:56 2011 UTC","comments":"He&#39;s not defending anyone, just being semantically accurate. There&#39;s a huge difference between being attracted to 12 year olds and 16 year olds in bikinis.","author":"Almalexia"},{"date":"Thu Oct 13 02:50:57 2011 UTC","comments":"The photo was not identifiably that of a minor. It is impossible to send files over reddit PMs. If a link was sent, the website hosting it would be the one to be v&amp;. The people asking for PMs could have PM&#39;d the requests.\nThe PM requests were likely jokes. ","author":"bobcat"},{"date":"Thu Oct 13 05:22:57 2011 UTC","comments":"Bottom line: if the mods acted more swiftly the subreddit may still exist today.\nThey can&#39;t be on 24/7.","author":"FillInTheBlank"},{"date":"Thu Oct 13 05:45:04 2011 UTC","comments":"If there&#39;s enough of them in different time zones, then yes they can.\nIt&#39;d need a big team though. But 4chan manages it. ","author":"couldbeglorious"},{"date":"Thu Oct 13 02:05:52 2011 UTC","comments":"<a href=\"http://www.reddit.com/r/reddit.com/comments/l9wuw/remember_that_jailbait_thread_with_users_begging/\">No they were not.<\/a> You&#39;ll also notice that the SA thread says nothing to this effect either. The headline here completely made it up.\nAlso, the admins confirmed that actual CP was PMed, which wouldn&#39;t have happened if SA was just faking it.","author":"1338h4x"},{"date":"Thu Oct 13 02:43:56 2011 UTC","comments":"Hahaha, you’re so desperate to believe reddit isn’t the shithole everyone else on the planet knows it is, you actually believe your community was framed. So funny. So sad.","author":"RedditsRagingId"},{"date":"Thu Oct 13 02:58:47 2011 UTC","comments":"The whole of reddit is not a shithole, just some parts of it","author":"Amp3r"},{"date":"Thu Oct 13 20:12:31 2011 UTC","comments":"I&#39;m pretty sure <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> is perverted enough on its own.","author":"PhysicsIsMyMistress"},{"date":"Thu Oct 13 02:45:51 2011 UTC","comments":"Can we still track them down and turn them in to the FBI? Just to make the joke complete.","author":"johnmudd"},{"date":"Thu Oct 13 00:20:42 2011 UTC","comments":"Hey could someone point me towards the post that reveals that that thread was nothing but goons?\nBecause I can&#39;t seem to find that post. And no one seems to have actually linked to it.","author":"PterodactylMan"},{"date":"Thu Oct 13 01:56:03 2011 UTC","comments":"They weren&#39;t. <a href=\"http://www.reddit.com/r/TheoryOfReddit/comments/l8evq/stats_on_the_users_who_pmed_op_in_rjailbait/\">Almost all the accounts asking for PMs were at least a month old.<\/a>","author":"1338h4x"},{"date":"Thu Oct 13 01:02:18 2011 UTC","comments":"The submission title is <del>pretty misleading<\/del> a lie. The SA thread shows that they were the ones who alerted Anderson Cooper, but I couldn&#39;t find any reference to that they were planing a raid. In fact <a href=\"http://www.reddit.com/r/TheoryOfReddit/comments/l8evq/stats_on_the_users_who_pmed_op_in_rjailbait/\">this statistic<\/a> indicates that the Pedos who posted in the infamous jailbait thread were in the majority legitimate users.","author":"dont_tell_my_mom"},{"date":"Thu Oct 13 07:59:41 2011 UTC","comments":"All good excel spreadsheets were typed using feet","author":"AlyoshaV"},{"date":"Wed Oct 12 22:21:31 2011 UTC","comments":"You all know that some people do go to multiple websites, right? Maybe it&#39;s just me, but I&#39;ve never sworn an oath of fealty to reddit. I peruse Fark and SA (although their content has gone down in quality and I don&#39;t use their forums). I don&#39;t go to 4chan, partially because it is blocked at work, but mostly because I don&#39;t like the format. \nReddit is not the end all of the internet. ","author":"RogueNine"},{"date":"Thu Oct 13 01:38:36 2011 UTC","comments":"I&#39;ve been a Farker for years and years, and finally I came over here on a day of serious boredom.  It has been fun.  I can say this for Fark, though, the cruel, ragged desert creatures that are left in the Politics tab over there offer no quarter whatsoever, and any misstep will be severely punished; as such, I have so far felt entirely prepared for what Reddit politics has to offer.","author":"Ikimasen"},{"date":"Thu Oct 13 01:47:09 2011 UTC","comments":"is that superjew character still on there? you know, the militant Hasbra settler who would pop up at the mention of israel and  defend it to the death?","author":"afellowinfidel"},{"date":"Thu Oct 13 01:51:29 2011 UTC","comments":"He. has. gotten. out. of. hand.  Outed on a hard, hard right alt with a kind of German name, compared those kids who got killed over in Norway to the Hitler Youth, defends Glenn Beck, he&#39;s straight bazonkers now.\nAnd Weaver is almost liberal now.","author":"Ikimasen"},{"date":"Thu Oct 13 02:22:26 2011 UTC","comments":"rofl....i&#39;m not surprised about the superjew, no one with that much glaring self deceit could survive the cognitive dissonance for long, and israel is taking a battering from all sides as of late... he must be going &#39;Private Pyle&#39; by now.\nand weaver went to the force? that&#39;s fucking hilarious. i remember that guy as a rabid bush fan, imagine that...","author":"afellowinfidel"},{"date":"Thu Oct 13 02:39:21 2011 UTC","comments":"Jesus, is Weaver everywhere? I encountered him on TableTalk lo so many years ago, then on The Rant, and then on The Perfect World. That guy&#39;s got a shitload of time on his hands. ","author":"Rexitrexi"},{"date":"Thu Oct 13 07:48:07 2011 UTC","comments":"Fark gave the world bevets, and for that it will never be forgiven.","author":"popeguilty"},{"date":"Thu Oct 13 00:32:06 2011 UTC","comments":"you&#39;re right, it&#39;s the frontpage of the internet!","author":"mHtt"},{"date":"Thu Oct 13 01:20:06 2011 UTC","comments":"and Fark is like the now discontinued &quot;homes and garden&quot; page that only came in the Sunday paper anyway and was never very informative.","author":"nanowerx"},{"date":"Thu Oct 13 01:30:55 2011 UTC","comments":"The Parade Magazine of the Internet. Relevant if you&#39;re a child or a senior, but nowhere in between?","author":"Genghis_John"},{"date":"Thu Oct 13 08:18:14 2011 UTC","comments":"Parade, like Reddit, is owned by Advance Publications. The circle is complete.","author":"SocratesDiedTrolling"},{"date":"Thu Oct 13 06:05:48 2011 UTC","comments":"I peruse Fark and SA (although their content has gone down in quality and I don&#39;t use their forums)\nCorrect. The only reason I started browsing reddit is because in the last 2 years Fark.com took a big nosedive.\nSomething Awful has been terrible since Lowtax stopped actually doing stuff.","author":"DonJunbar"},{"date":"Thu Oct 13 06:53:26 2011 UTC","comments":"fanboyism in all its forms is ridiculous.","author":"fuzzywinkles"},{"date":"Thu Oct 13 01:26:24 2011 UTC","comments":"There&#39;s still motherless.com.","author":"headzoo"},{"date":"Wed Oct 12 22:38:32 2011 UTC","comments":"While gbs has gone downhill lately the discussion is generally far less immature than on reddit. Don&#39;t feel too bad though, reddit discussion is still more intelligent than YouTube comments. It&#39;s also worth noting that the crackhead clubhouse forum is far more informative mature and friendlier than trees. Now the reason for this is not because people who use something awful are necessarily better than redditors, many people use both, it&#39;s simply that you have to pay for an account on SA and you can be banned for being an ass, so it tends to filter out the shitty posts quite well.","author":"lumpystumps"},{"date":"Thu Oct 13 07:45:20 2011 UTC","comments":"While gbs has gone downhill lately\nYeeeeah, people have been saying that since back when I started lurking, and that was before you had to pay.","author":"popeguilty"},{"date":"Thu Oct 13 04:57:04 2011 UTC","comments":"the discussion is generally far less immature than on reddit\nOh dear. As someone who&#39;s been a member of SA before AYBABTU and long before it cost money to register I have to say there&#39;s very little difference. There are many mature and thoughtful communities on the internet, but neither SA nor reddit rank among them. And no, I have no desire to advertise them here. If you search in earnest you will find them.\nSA&#39;s distinguishing characteristic is, if anything, its insular and self-encouraging culture. It is a heavily censored community -- it is of little surprise that its members in turn promote censorship of less controlled communities such as reddit.","author":"uncle_nardicles"},{"date":"Thu Oct 13 05:38:26 2011 UTC","comments":"I agree with this entirely. Yeah, the content of GBS may have gone down, but looking at the 1st page right now I only see a few threads under 200 posts, and the majority have 2000+. Obviously postcount =/= quality content, but hey, at least there&#39;s a discussion going on rather than hundreds of people saying the same thing and 3 people getting karma for it. \nI&#39;ve put about 30$ into my SA account, and I do not regret it in the slightest. ","author":"dnalloheoj"},{"date":"Thu Oct 13 02:02:59 2011 UTC","comments":"I&#39;ve seen no lack of shitty posts, and quite a few ass holes that went unbanned. I fail to see any real logic in the argument other than the &quot;Payment&quot; part of it. Aside from perma-bans, all other non permanent bans just raise more money from repeat users. Hell, even perma-banned people come back asking for more, and paying. It&#39;s a revolving door, not a filter.\nImmaturity is what SA is based on, and &quot;raiding&quot; other sites does prove that point.","author":"japov"},{"date":"Thu Oct 13 06:27:24 2011 UTC","comments":"They don&#39;t raid sites though.  They didn&#39;t raid <a href=\"/r/jailbait\">r/jailbait<\/a>, and any mention of a raid is banworthy.","author":"Toaka"},{"date":"Thu Oct 13 08:00:16 2011 UTC","comments":"While gbs has gone downhill <em>lately<\/em>\nlol","author":"AlyoshaV"},{"date":"Thu Oct 13 02:05:07 2011 UTC","comments":"&quot;I thought reddit used to be just an ugly version of Digg. I didn&#39;t know it had turned into 4chan for middle-aged people.&quot;\nTouche Costello Jello Touche","author":"darksider"},{"date":"Thu Oct 13 08:00:21 2011 UTC","comments":"Comparing SA and 4chan is basically a way of saying &quot;I have no idea what at least one and probably both of those sites are like.&quot;","author":"popeguilty"},{"date":"Wed Oct 12 22:21:02 2011 UTC","comments":"<a href=\"http://i.imgur.com/hMAaf.png\">Reddit: Too creepy for 4chan.<\/a>","author":"bananaswild"},{"date":"Thu Oct 13 05:05:30 2011 UTC","comments":"Crap, I&#39;ve told people what an ephebophile is.","author":"generic_tastes"},{"date":"Thu Oct 13 03:20:12 2011 UTC","comments":"Neither pedophilia nor ephebophilia is morally wrong. There&#39;s no way to control who you&#39;re attracted too. What&#39;s wrong is <em>acting<\/em> on those desires.","author":"padawangabe"},{"date":"Thu Oct 13 06:40:09 2011 UTC","comments":"The only issue with pedophilia, and to a lesser extent ephebophilia, is that of informed consent. Given that the parties in question are very young and, presumably, fairly naive, it&#39;s a completely different level of immoral. As stated many times, you can&#39;t control who you&#39;re attracted to; the fact that minors are generally believed to be less capable of making decisions for themselves is what makes it &#39;creepy&#39; and &#39;wrong&#39;. \nRemember folks, morals and ethics are still very highly debated topics, and there&#39;s no real consensus on whether they&#39;re natural or social (though some would argue that social is natural, too) constructs. ","author":"Palia_Psychi"},{"date":"Thu Oct 13 02:01:08 2011 UTC","comments":"I was more surprised that people still went on Something Awful.","author":"cheshiregrins"},{"date":"Wed Oct 12 23:23:56 2011 UTC","comments":"<a href=\"http://i.imgur.com/oJN88.png\">Megafunk is a prophet<\/a>","author":"jwags1892"},{"date":"Wed Oct 12 22:32:40 2011 UTC","comments":"Maybe they&#39;ll ask to buy some weed in <a href=\"/r/trees\">r/trees<\/a> next...","author":"laalaa"},{"date":"Thu Oct 13 04:46:10 2011 UTC","comments":"But for some reason they don&#39;t screen cap it and post it everywhere. ","author":"keytud"},{"date":"Thu Oct 13 06:15:13 2011 UTC","comments":"My opinion that probably no one will read is that it should not have existed in the first place. 1 child being hurt in any way is to many.","author":"Cerium5800"},{"date":"Thu Oct 13 10:44:14 2011 UTC","comments":"It&#39;s never a good idea to trust any community built around cynicism.","author":"Phoequinox"},{"date":"Thu Oct 13 03:25:20 2011 UTC","comments":"I just need to get this off my chest: any man who claims he doesn&#39;t find developed, well-endowed, post-pubescent teenage girls attractive is either a) lying b) completely sexually repressed or c) has some fetish that directs his interests elsewhere.\nTo find it immoral, logically, with regards to law and the workings of society is something else entirely, and I&#39;m not here to debate that... but I&#39;m sick of reading these white-knight posts from guys (supposedly) who think that finding teenage girls attractive is somehow abnormal or pedophilic.  Remember high-school?  I don&#39;t know about the majority of Redditors, but when I hit my 18th birthday I didn&#39;t stop finding 16 year old girls attractive.  And if I live to be 100, I&#39;m pretty sure I will <em>still<\/em> find 16 year old girls attractive.\nI know that&#39;s not the only issue at hand- and frankly I don&#39;t give a damn whether <a href=\"/r/jailbait\">r/jailbait<\/a> returns or not- but I&#39;m really getting annoyed by some of the blatant posing and misdirection from some quarters.  Who are you trying to impress here guys?  Can&#39;t we at least be honest about both sides of the problem?  It&#39;s not a one way street in either direction.  /rant","author":"Frumpy_stumpster"},{"date":"Thu Oct 13 06:58:50 2011 UTC","comments":"You&#39;re acting like the outrage is entirely directed at dudes who are attracted to girls who look fully mature but happen to be under the semi-arbitrary legal limit. That isn&#39;t the problem. It&#39;s the <em>focus<\/em> on the underaged-ness that is creepy.\nAnd I for one am not so attracted to teenagers. They&#39;re <em>kids.<\/em> Society doesn&#39;t treat them like adults, they don&#39;t act like adults.  Not just overt behavior - I&#39;m talking shit like body language here. But maybe I&#39;m the weird one for taking more than just static appearance into account.","author":"kftrendy"},{"date":"Thu Oct 13 19:04:21 2011 UTC","comments":"As far as images go, static appearance is really all there is to take into account.","author":"ethraax"},{"date":"Thu Oct 13 19:02:14 2011 UTC","comments":"Its because the majority of reddit are Americans. American&#39;s have retained much of their puritan heritage (AKA baggage) and their cultural views on sex. \nThere is an strong undertone of protecting the fairer sex (there would be no outrage if jailbait was just full of recent sexually-developed young men). This argument that the girls are being &quot;exploited&quot; by being looked at on a monitor by perverted men is an extension of puritanical beliefs on the &quot;temple of our bodies&quot;. That is, god granted us an innocent and pure body and it must not be sullied by sex, or even the act of being looked at by others with thoughts of sex. Much of &quot;PROTECT THE CHILDREN&quot; paranoia sweeping through the US is a result of this. \nEven if you are non-religious, any intelligent American has to admit that they too are influenced by these (I believe backward) undertows of American culture, which to this day remain firmly integrated. But to be aware of such influence, especially in such relevant arguments around the banning of <a href=\"/r/jailbait\">r/jailbait<\/a>, is critical in coming to terms and understanding why the community supports the move (and blind to what you say Frumpy_stumpster). You would be surprised at what indoctrination can do to the psyche. It&#39;s very easy for the human mind to rationalize away and make invisible to itself much of our basic urges, sexual and non-sexual.","author":"wuy3"},{"date":"Thu Oct 13 06:07:45 2011 UTC","comments":"I think for a lot of people, it&#39;s that while a 16 year old might be attractive, a 22 year old is just as attractive. So why jerk it to the minor?","author":"borpo"},{"date":"Thu Oct 13 10:35:37 2011 UTC","comments":"You have made more sense, in one post, than most of the commentors in the various threads that have popped up about this topic have made in thousands of posts.\nIt heartens me to know that there are still people who are capable of thought that don&#39;t mind posting on here.\nI, for one, hadn&#39;t even really thought about this angle, but you&#39;re absolutely correct. <a href=\"http://en.wikipedia.org/wiki/Jailbait\">Jailbait<\/a>, by common definition, means that one would be fooled into thinking that they&#39;re (the girls in question) of legal age. The real joke in this is that the definition uses legal age (typically the <a href=\"http://en.wikipedia.org/wiki/Age_of_consent\">Age of Consent<\/a>) as the line between jailbait and hot, but legal age is a tenuous and shifting thing dependent upon local mores.\nBiologically, puberty (specifically, menses) is the indicator for sexual preparedness. If you can get pregnant, typically you start mating. Except in humans.\n<strong>Still not advocating CP.<\/strong>","author":"johnsix"},{"date":"Thu Oct 13 08:50:46 2011 UTC","comments":"When I was 13, I thought 13 year olds and 12 year olds were attractive.  When I was 16, I thought 16 year olds and 14 year olds were attractive.  When I was 18, I thought 17 year olds and 16 year olds were attractive.\nKnow who I didn&#39;t find attractive?  12 year olds.\nPlenty of girls don&#39;t even start menstruating UNTIL age 16.  Stop acting like 16 year olds are <em>done.<\/em>  Like there&#39;s a fucking egg timer and it&#39;s dinging and you have to wait two more years to get your chance.\nPuberty is a process, and the vast majority of girls at age 16 sure the fuck aren&#39;t done.  I&#39;ve worked with campers frequently, and while it is possible to confuse one or two of them with 18 year olds, it&#39;s a long, thin stretch of the imagination to think that most 16 year olds are just tighter, fitter, fresher 18 year olds.  Many of them haven&#39;t even developed curves yet.\nAlthough, I suppose this is a society that celebrates thin frames...","author":"BZenMojo"},{"date":"Thu Oct 13 11:27:52 2011 UTC","comments":"Stop acting like 16 year olds are done.\n16 &amp; Pregnant. They seem well done to me. Double (or even more) entendre included.","author":"ShamwowTseDung"},{"date":"Wed Oct 12 21:58:15 2011 UTC","comments":"We are all better for having lost it.","author":"novalsi"},{"date":"Wed Oct 12 23:51:17 2011 UTC","comments":"dude running it was a creeper. I agree, we are better off.","author":"OMGnoogies"},{"date":"Thu Oct 13 01:46:24 2011 UTC","comments":"Just like the good ol days. Bravo, SA.","author":"LiveToThink"},{"date":"Thu Oct 13 07:48:30 2011 UTC","comments":"As both a SA member and Redditor, that SA thread was a little disconcerting. SA is usually pretty reasonable, but the general consensus in that post is that the, what, ~1-2% of Reddit who visited <a href=\"/r/jailbait\">r/jailbait<\/a> = ALL OF REDDIT! I&#39;m certainly not going to defend <a href=\"/r/jailbait\">r/jailbait<\/a>, and I&#39;m glad it&#39;s gone, but being deliberately misleading about the size of its community doesn&#39;t help matters.\nYes, SA&#39;s posts are cleaner and typically more mature... unless we drop into one of the shit forums like FYAD. What they&#39;re effectively saying is that an entire internet community should be judged by its lowest point, which is absurd, especially given any Redditor&#39;s ability to create whatever subreddit they choose.\nI like SA for the original content, mature posting, and so on. I like Reddit for quick entertainment and its superior reply threading.","author":"AcronymEjr"},{"date":"Thu Oct 13 16:36:29 2011 UTC","comments":"4th most popular subreddit, according to Google. It is more popular than F7U12. 29% of all search traffic for jailbait comes to reddit. This is not a fringe activity lurking around the edges; it is a vital part of the beating heart of reddit.","author":"nubckaes"},{"date":"Thu Oct 13 01:57:08 2011 UTC","comments":"Headline is grossly wrong. <a href=\"http://www.reddit.com/r/TheoryOfReddit/comments/l8evq/stats_on_the_users_who_pmed_op_in_rjailbait/\">The accounts requesting CP were almost all over a month old<\/a>, and nowhere does this link prove that SA faked this. All SA did was investigate and tip the media off about <a href=\"/r/jailbait\">r/jailbait<\/a>&#39;s issues, and there&#39;s nothing disingenous about that.","author":"1338h4x"},{"date":"Thu Oct 13 11:54:08 2011 UTC","comments":"Raids are often planned more than a month in advance, you know...","author":"AtomicDog1471"},{"date":"Thu Oct 13 14:41:20 2011 UTC","comments":"And not generally in the public forums, but rather through IRC, IM, etc.\nAnd many people have throwaway accounts on multiple sites that are registered and set aside, or would even sacrifice a legit account to accomplish their goal (Oh noes, I&#39;d lose my karma?!)\nNot that I&#39;m saying SA had much of anything to do with it, or whether it was a troll at all, or what it appeared to be on the surface. I&#39;m just saying I don&#39;t see convincing evidence either way, and people taking a hardline stance that it&#39;s totally legit or totally a troll are probably suffering from confirmation bias.","author":"tremens"},{"date":"Wed Oct 12 23:49:13 2011 UTC","comments":"I mean, what sort of comments are you looking for on gonewild? &quot;Oh I love your hair; where do you get it done?&quot; &quot;You have a real knack for photography.&quot; Don&#39;t quite work.","author":"fivre"},{"date":"Thu Oct 13 00:42:56 2011 UTC","comments":"&quot;That armoire really ties the room together. Oh, and, lovely tits.&quot;","author":"aguacate"},{"date":"Thu Oct 13 01:01:54 2011 UTC","comments":"The feng shui of your room is spectacular, what a nice asshole!","author":"NotSoFatThrowAway"},{"date":"Thu Oct 13 02:00:23 2011 UTC","comments":"I say, that asshole looks like it should be effective at pinching off loafs! ","author":"fiat_lux_"},{"date":"Thu Oct 13 01:10:34 2011 UTC","comments":"Always the best comment to receive.","author":"nanowerx"},{"date":"Thu Oct 13 01:14:06 2011 UTC","comments":"I wish someone would like my feng shui. :(","author":"NotSoFatThrowAway"},{"date":"Thu Oct 13 08:15:30 2011 UTC","comments":"&quot;Ties the room together&quot; is my new favorite expression. I can&#39;t explain why I find it hilarious.","author":"Garnelio"},{"date":"Thu Oct 13 02:50:58 2011 UTC","comments":"HOLY SHIT I HAVE THAT RUG","author":"Kurtank"},{"date":"Thu Oct 13 09:55:24 2011 UTC","comments":"You can&#39;t deny that most of the gonewild comments come up as extremely awkward or embarrassing.\n&quot;ooooh, looking good sweetie ;) I would definitely love to see more! ;)&quot;\nI&#39;m not even exaggerating this, just go check a thread and you&#39;ll see winky faces EVERYWHERE, it just reeks of neckbeard virgins","author":"Lmkt"},{"date":"Thu Oct 13 17:31:31 2011 UTC","comments":"Yet everyone who posts to gonewild is looking for exactly that self validating drivel. So by definition it is not awkward if that is what the people posting want.","author":"RapidEyeMovement"},{"date":"Thu Oct 13 08:26:03 2011 UTC","comments":"I have never agreed with a reddit post more than this.","author":"AlmoschFamous"},{"date":"Thu Oct 13 09:03:27 2011 UTC","comments":"Yep, SA goon for 7 years (oh my good god) and redditor for a few months, this is incredibly accurate.\nI really like SA&#39;s moderating team with some exceptions (grover), since the rules are pretty fair and lead to some great discussions and content.\nAnd I love how every fifth post on something awful isn&#39;t &quot;It&#39;s shit like this...&quot; or a fry meme.\nI also love how there&#39;s no fucking karma system.","author":"RyenDeckard"},{"date":"Thu Oct 13 01:35:16 2011 UTC","comments":"<strong><em>12-20-year-old girls<\/em><\/strong>","author":"trolling_thunder"},{"date":"Thu Oct 13 02:51:58 2011 UTC","comments":"Your username pleases me.","author":"grammatiker"},{"date":"Wed Oct 12 23:13:08 2011 UTC","comments":"Being attracted to 16-20 year olds is not pedophilia. \n<a href=\"http://en.wikipedia.org/wiki/Pedophilia\">http://en.wikipedia.org/wiki/Pedophilia<\/a>\nAttraction to people who have passed through puberty is called ephebophilia. There is no academic consensus that this is a psychological abnormality though there has been a legal push in recent years to increasingly criminalize related behavior: increasing the age of consent, implementing strict liability regardless of reasonable belief as to the age of the person, stricter &quot;child pornography&quot; laws, etc.\n<a href=\"http://en.wikipedia.org/wiki/Ephebophilia\">http://en.wikipedia.org/wiki/Ephebophilia<\/a>","author":"wavegeekman"},{"date":"Wed Oct 12 23:59:04 2011 UTC","comments":"Being attracted to women with developed sexual features of any age is called being a Man.","author":"Karmaisforsuckers"},{"date":"Thu Oct 13 00:54:31 2011 UTC","comments":"Heterosexual you mean.","author":"JonathanUnicorn"},{"date":"Thu Oct 13 06:43:20 2011 UTC","comments":"Hello ","author":"Gynophile"},{"date":"Thu Oct 13 12:22:11 2011 UTC","comments":"Heterosexual man, in particular. Or lesbian.","author":"Deadmirth"},{"date":"Thu Oct 13 01:11:35 2011 UTC","comments":"he didn&#39;t say it was restricted to that. &#3232;_&#3232;","author":"Ch4rd"},{"date":"Thu Oct 13 00:55:29 2011 UTC","comments":"Pictures of <em>women<\/em> wouldn&#39;t appear in <a href=\"/r/jailbait\">/r/jailbait<\/a>, though would they, as women are adults.","author":"Hawklan"},{"date":"Thu Oct 13 01:45:46 2011 UTC","comments":"Teenagers have been considered adults in all cultures up until the last two hundred years. Even today there are languages where the word &quot;teenager&quot; doesn&#39;t exist and teens are treated like young adults. Furthermore, teenagers have sexual feelings and have sex and know what sex is. I certainly became an adult by age 15, and I know many 16 year olds that are more intelligent and mature than the random crop of 30 year olds I see on the bus every day.\nI am getting pretty sick of people ignoring reality and trying to extend childhood, is it any wonder teens in western countries are so angsty?\nDownvote me to oblivion, but <strong>I would also like to get an interesting discussion going<\/strong> because I legitimately do not understand why young men who like sexually mature girls are demonized and why so many of us pretend like teenagers will be ruined by sex or sexual attention even on a left-leaning site like Reddit.\nHumbly awaiting replies,\nJustinTime112","author":"JustinTime112"},{"date":"Thu Oct 13 07:34:45 2011 UTC","comments":"The fact that our culture doesn&#39;t treat teenagers as adults is <em>precisely<\/em> why it&#39;s creepy for a grown person to be attracted to them.  For most people, sexual attraction is due to a combination of factors - static physical appearance is only one.  If you are attracted to people who are <em>not adults,<\/em> it&#39;s weird, because they <em>don&#39;t act like adults.<\/em>\nNot using &quot;adult&quot; in the legal sense here.  Using it in a vague cultural sense.  It&#39;s the difference between your average high school student and your average college grad. No, high school grads aren&#39;t adults. Not usually, at least. And going to college makes the transition take even longer.\nSo, it&#39;s creepy because <em>you&#39;re an adult, and they aren&#39;t.<\/em>","author":"kftrendy"},{"date":"Thu Oct 13 07:46:53 2011 UTC","comments":"So it&#39;s bad because it&#39;s creepy and it&#39;s creepy because our culture says it&#39;s creepy?\nThat makes sense in a tautological way I suppose.","author":"JustinTime112"},{"date":"Thu Oct 13 02:08:02 2011 UTC","comments":"It&#39;s an interesting point. I suppose it has to do with the nature of changing societal and cultural morality.\nJust because something was acceptable in the past does not give it any validity in modern times. Take any other subject: religion, race, women&#39;s rights and go back 200 hundred years, and you&#39;ll (hopefully) find the attitudes then to such matters as unacceptable by today&#39;s standards. \nI&#39;m not saying it invalidates your point necessarily, but personally I find history to be a dry well when looking for moral direction.\nI was sexually active at 14, with other similar aged partners. I&#39;m sure I would have, as I&#39;m sure I had fantasized often about, had sex with older women, particularly some of my teachers. I think this is pretty normal. I honestly don&#39;t know if similar aged girls did the same about men. I&#39;m not sure what affect it would have had on me had I been able to carry out such a fantasy. On the one hand I&#39;d be having sex, with a <em>woman<\/em>, on the other I would have been a callow youth and who knows what &#39;love&#39; or jealousy or intimidation I might have gone through.\nRegardless, I don&#39;t accept your assertion that teenagers are sexually mature enough to be considered adults in western society. Teenagers by and large don&#39;t know shit, and that&#39;s because they&#39;re going through all that growing up bullshit part of their life, often the most difficult part. Its also a period when they&#39;re vulnerable. Hormones conflict with reason and naivety can be manipulated. Precociously discovering your sexuality with your peers is difficult enough, being &#39;preyed upon&#39; by someone mature could be very damaging.","author":"Hawklan"},{"date":"Thu Oct 13 02:23:49 2011 UTC","comments":"Come on. It&#39;s the power dynamic. You know this. Just because a girl&#39;s body is developed doesn&#39;t mean she is mature mentally. I grew tits at 12 - do you really think I could handle a 22 year old coming on to me? That I knew what to do about that? Or how to say no? The first guy I slept with was 24. I was 14. He manipulated me, played on my insecurities, convinced me that he loved me and that sex is what you do with people who love you. Really, I just wanted to watch cartoons and read Anne McCaffrey novels. I wanted someone to love me and I wanted to please him. I was curious about sex, but in no way was I ready for it. I was terrified, it hurt, I cried for hours and felt dirty for days afterwards. It was the beginning of a long Downward spiral where I thought no guy would ever like me if I didn&#39;t put out. And I thought it was my fault for a long long time. Now, in my 30s, I know that there was something deeply fucking wrong with that guy. He was a predator and I was prey. And while he didn&#39;t rape me, he did destroy my innocence and fuck up my views of sex for a long time. \nI have never told this story to anyone before.\nAnd that&#39;s why, boys and girls, it&#39;s not ok to fuck someone who is a child when you are an adult. You have the maturity to manipulate them in ways they can&#39;t anticipate or counter. You are an authority figure, you hold all the cards. This is the same reason it&#39;s wrong to fuck your students, your employees, prisoners, etc. It&#39;s always a coercive relationship.","author":"Rexitrexi"},{"date":"Thu Oct 13 11:36:07 2011 UTC","comments":"Well said. ","author":"akaxaka"},{"date":"Thu Oct 13 07:52:13 2011 UTC","comments":"I am terribly sorry you had to suffer through that. <em>hugs<\/em>","author":"StreeTelevision"},{"date":"Thu Oct 13 03:45:21 2011 UTC","comments":"The reason men who like teenagers are demonized is because when they act on it, they <em>privilege their sexual satisfaction over the emotional validity of another human being.<\/em>\nActing on it doesn&#39;t just mean having sex with underage girls. Passing around photos like those exhibited on <a href=\"/r/jailbait\">r/jailbait<\/a>-- photos that were obtained against the will and knowledge of their subjects-- and using them as masturbation fodder displays a stunning lack of empathy for the girls depicted. They are not objects for your sexual perusal. They are human beings who have lives, friends, and reputations. Their images are <em>hijacked<\/em> for the gratification of uncaring strangers.\nThis argument that what <a href=\"/r/jailbait\">r/jailbait<\/a> stood for is okay because &quot;teenagers have sexual feelings and have sex and they know what sex is&quot; is ludicrous. These girls have not given you access to any of those things. And if they do give access to adult men, they do not make those decisions as adults. Adults understand consequences and make reasoned decisions; teenagers do not have that cognitive capacity. Their decision-making is warped by their limited, callow understanding of the world in which they live. \nWhen I had sex as a teenager, it was for approval or to prove something. This does not make sense now but it did at the time. Luckily, I was having sex with other teenagers who were just as stupid as I was-- not men manipulating my underdeveloped reasoning process for their sexual gratification.\nNo one should be calling men out for being attracted to teenage girls. That&#39;s natural, and it makes sense. But to claim ignorance as to why they are forbidden makes you lose credibility. Teenagers are developed sexually but they are not developed emotionally or cognitively. If you can&#39;t see how that plays into their sexual and social decision-making, you&#39;re missing the point. ","author":"baskingturtles"},{"date":"Thu Oct 13 06:01:12 2011 UTC","comments":"&quot;Well, she&#39;s reached sexual maturity! ...so therefore I&#39;m entitled to look at pictures of her body regardless of whether or not she&#39;s willing or aware of it.&quot;","author":"baskingturtles"},{"date":"Thu Oct 13 07:14:04 2011 UTC","comments":"they privilege their sexual satisfaction over the emotional validity of another human being.\nThey are human beings who have lives, friends, and reputations. \nThis goes for adults as well. We can&#39;t have all this modern, sexually liberated, do whatever you want, sex-as-sex is awesome cultural climate, and then claim that it&#39;s &quot;morally wrong&quot; to seek sexual satisfaction without regard for others&#39; &quot;emotional validity&quot; (wat). If you want to go back to &quot;sex is only for when you truly love someone&quot;, &quot;no sex before marriage&quot; etc. etc., sure, I&#39;m fine with that, just please be consistent.","author":"Shin-LaC"},{"date":"Thu Oct 13 08:53:20 2011 UTC","comments":"like sexually <em>maturing<\/em> girls\nFTFY\nYou know who else is sexually maturing?  12 year olds.  Hey, look, tits and menstruation.  Guess she&#39;s a woman now.\nIn the old days, people were stupid, children worked in factories, and black people were property.  Digging into a society two centuries ago to defend your tastes is kind of bizarre.","author":"BZenMojo"},{"date":"Thu Oct 13 22:52:43 2011 UTC","comments":"Not my tastes, please do not personalize this issue. Just as straights can argue on behalf of gays, I am arguing on behalf of ephebophiles despite not being one.\n12 year olds are a worse case scenario, there are many girls who are not sexually mature by then and some that are. I would draw the legal line at 14, because by then just about every girl is sexually mature. Not only that, but teenagers (not 12 year olds) have developed higher thinking and the ability to reason, and generally are capable of knowing the dangers of pregnancy and STIs at a knowledge level comparable to 18 year olds.","author":"JustinTime112"},{"date":"Thu Oct 13 12:15:30 2011 UTC","comments":"Rape was acceptable in many cultures for thousands of years. So was slavery and child labor. That is meaningless shit.","author":"Dark1000"},{"date":"Thu Oct 13 22:59:04 2011 UTC","comments":"Agreed, natural does not equal right. However, 15-17 year old girls having consensual and informed sex is not equivalent to slavery or rape.\nEDIT: Not just girls, guys too. For some reason it is okay that guys have sex in their teens but a terrible crime if the gender is reversed.","author":"JustinTime112"},{"date":"Thu Oct 13 02:11:22 2011 UTC","comments":"+1 to all of that.  It&#39;s confusing to me that people are so passionate about a topic that seems entirely manufactured by the conservative values of their society.  Especially when, specifically, they mistake the attraction to human beings with fully developed sexual and secondary sexual characteristics to be the same as being attracted to children.  That is a substantial difference.  It&#39;s so different that there&#39;s a disconnect from reality required to believe that they are the same thing.  \nIt confuses me that so many people are fully disconnected from reality and passionate about that disconnect when, 100 years ago, they would be starting families with the teenagers who they now define as children.  ","author":"Azzmo"},{"date":"Thu Oct 13 00:15:43 2011 UTC","comments":"It&#39;s sad that this is getting downvoted.\nWhen people say &quot;THEY&#39;RE NOT PEDOPHILES THEY&#39;RE EPHEBOPHILES&quot; it&#39;s not about trying to &quot;defend&quot; jailbaiters, it&#39;s about being semantically accurate. You can&#39;t use the same word to describe both someone who is attracted to 8-year-olds in bondage gear and someone who is attracted to 16-year-olds in bikinis, it&#39;s too broad a spectrum.","author":"Exocytosis"},{"date":"Thu Oct 13 01:26:13 2011 UTC","comments":"Semantically correct is the best kind of correct!","author":"Del_Castigator"},{"date":"Thu Oct 13 15:43:06 2011 UTC","comments":"That&#39;s actually an important point to make.  While I don&#39;t have any problem with people being simply attracted to the people in question to be objectionable, having a strong preference for them is another thing.  That&#39;s definitely a bit weird, if not abnormal.","author":"Mousi"},{"date":"Thu Oct 13 07:57:26 2011 UTC","comments":"Wrong, they <em>are<\/em> trying to defend the ephebos, by deflecting the conversation into semantics. Most everyone who makes that argument is bullshitting. Note that when the pedo/ephebo point is made, there&#39;s usually little actual justification for <em>why<\/em> it&#39;s so much better that they&#39;re ephebophiles instead of pedos. Moving a conversation into a discussion of semantics is an easy way to act like you&#39;re responding to an argument, when you&#39;re really just reading from the dictionary.\nI&#39;ve only had <em>one<\/em> person make a semantic argument in good faith, and that guy had Asperger&#39;s.  And if everyone making semantic arguments was doing it in good faith, we&#39;d see it a lot more, on a much wider variety of topics.  As it stands, there&#39;s a conspicuous concentration of semantic arguments on the pedo/ephebo issue.\nAnd just so I have a little something to back up my implied point (that being an ephebophile is still unacceptable): our society doesn&#39;t treat teenagers like adults, despite their <em>physical<\/em> maturity. Because of this, <em>they ain&#39;t adults.<\/em> And it is <em>creepy<\/em> to be attracted to non-adults.","author":"kftrendy"},{"date":"Thu Oct 13 13:21:53 2011 UTC","comments":"I&#39;m sure you&#39;ve never found a high school girl attractive ever. Not even in passing.","author":"Almalexia"},{"date":"Thu Oct 13 18:35:40 2011 UTC","comments":"I didn&#39;t steal her photos, post them in public, and masturbate to them while posting about how much I&#39;d like to commit statutory rape on her. That&#39;s what the jailbait subreddit was. It wasn&#39;t an artful discussion of the female form that occasionally included 16-17 year olds. It was a subreddit meant for masturbation featuring girls younger than 14.\nEveryone finds younger girls attractive, shit, sometimes I see a girl on the train and think she&#39;s cute before realizing she&#39;s much younger than me. But that&#39;s it. I don&#39;t track her down, I don&#39;t stalk her or find out her information, I don&#39;t creep on her pictures. I don&#39;t parade around in public proud of the fact that I jerk off to 15 year olds.","author":"xieish"},{"date":"Thu Oct 13 17:47:10 2011 UTC","comments":"I&#39;m talking generally. Unless you&#39;re arguing that <a href=\"/r/jailbait\" rel=\"nofollow\">/r/jailbait<\/a> was dominated by could-pass-for-early-20s teenagers.","author":"kftrendy"},{"date":"Thu Oct 13 15:40:21 2011 UTC","comments":"SpeedSteamBoat, you&#39;re arguing from logic with someone who argues from emotion.  I don&#39;t see them being swayed.","author":"Mousi"},{"date":"Thu Oct 13 17:30:19 2011 UTC","comments":"So the measure of an adult is whether or not &quot;society&quot; treats you as an adult? That&#39;s the criteria?\nThat <em>and<\/em> physical maturity. I think the defenders of ephebos unrealistically discount the effects that our culture has on development, just as you accuse me of overplaying its effects.<blockquote>\nThat being the case I don&#39;t understand why you find it creepy to be &gt;attracted to &quot;non-adults.&quot; Apparently it&#39;s an primarily arbitrary label &gt;based on some mythical modern idea that birthdays are the ultimate &gt;measure of a persons development, so why hold it in such high regard &gt;as to make blanket moral judgments based on that alone?\nNo, not birthdays. I&#39;m not going to go and set a rigid limit on what ages are acceptable and what ages aren&#39;t, because everyone is different and grows up in a different environment.<blockquote>\nFurthermore, you never specified what it means to be &quot;treated as an adults.&quot;\nEverything you mention is a step along the way. It&#39;s not like there&#39;s some magical limit that you cross and you&#39;re suddenly an adult, it&#39;s a process, and a gradual one, and one that depends on the individual.\nLook, this is what I&#39;m saying: Folks in the 16-20 age range have not yet developed the full ability to deal with the issues that adults face, because our culture generally doesn&#39;t force them to tackle those issues on their own. Yes, it&#39;s a vague description. People are complicated. There <em>will<\/em> be exceptions. However, the vast majority of high schoolers and college undergrads that I&#39;ve met are <em>very immature,<\/em> in a way that&#39;s immediately distinguishable from people closer to my age.","author":"kftrendy"},{"date":"Wed Oct 19 04:59:17 2011 UTC","comments":"How did you gain these extraordinary powers of mind-reading, which enable you to know who is posting in good faith or not?<blockquote>\nAnd it is creepy to be attracted to non-adults\nIt is absolutely normal for men to be attracted to 16 yo females. That is why women try to look younger! That is why cosmetics companies advertise &quot;look younger&quot;.\nTake your shaming language elsewhere.","author":"wavegeekman"},{"date":"Thu Oct 13 15:36:29 2011 UTC","comments":"Note that when the pedo/ephebo point is made, there&#39;s usually little actual justification for why it&#39;s so much better that they&#39;re ephebophiles instead of pedos.\nAre you insane?  Are you suggesting that there isn&#39;t an ENORMOUS difference between the two? Because if you are, you need a brain transplant.  \nThe former are children.  The latter are usually sexually active people that happen to be under the age of consent in certain countries and finding them attractive is taboo in certain cultures.  The vast majority of <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> was pics of 16-19 year olds.  If you want to make the case that it&#39;s degenerate to be attracted to people that age, sure, go do that, I&#39;ll listen to your argument if you can actually make one. Don&#39;t go and compare those people who do to mentally ill criminals like pedophiles without backing it up with ANY logic whatsoever.","author":"Mousi"},{"date":"Wed Oct 12 22:53:24 2011 UTC","comments":"I think we can all agree that SA raided because The Gentleman&#39;s Club got shut down years ago and since they can&#39;t have nice things no one can have nice things.  I think it was called TGC god its been years since that was boarded up.\nOr maybe it is because they knew it would piss everyone off here and knew it was an easy target.","author":"lAmShocked"},{"date":"Wed Oct 12 23:56:08 2011 UTC","comments":"I think we can all agree that SA raided because The Gentleman&#39;s Club got shut down years ago and since they can&#39;t have nice things no one can have nice things. \nI&#39;m pretty sure the people posting in that thread did not consider Jailbait to be in the category of &#39;nice things&#39;","author":"Calexica"},{"date":"Thu Oct 13 01:51:33 2011 UTC","comments":"TGC was shut down because it was all torrents - just like the rest of the torrent forums on SA. There was never any underage content in TGC and if there was, it was quickly removed and whoever posted it was permabanned. ","author":"unctaco"},{"date":"Thu Oct 13 00:32:02 2011 UTC","comments":"or maybe they thought it was sick and wrong for dirty men to be circle jerking to pics of 12 year olds","author":"tiffany43"},{"date":"Thu Oct 13 02:18:49 2011 UTC","comments":"If you think this, you don&#39;t understand most trolls, 4chan or SA. I&#39;ve been around the Internet for a long time, and I&#39;ve participated in plenty of raids organized on many, many different sites.\nUntil Chanology, there was pretty much no morality behind it. It was just, &quot;Let&#39;s go piss some people off!&quot; Also it&#39;s SA; I sincerely doubt they give a shit about jaybee.","author":"OverlordXenu"},{"date":"Thu Oct 13 02:26:11 2011 UTC","comments":"You&#39;re right. When people talking about 4chan saving kittens and getting pedo&#39;s arrested, it&#39;s not out of morality or because they care. They just want to cause chaos. They want to watch people go to jail. They want to fuck peoples lives up, and this is how they can do that. ","author":"marvelgirl"},{"date":"Thu Oct 13 08:17:11 2011 UTC","comments":"Same reason <em>To Catch A Predator<\/em> was popular enough to air twice a week; the desire desire to watch someone&#39;s life end in front of a television camera. ","author":"gngstrMNKY"},{"date":"Thu Oct 13 07:39:33 2011 UTC","comments":"At SA, we ban for that shit. The quickest way to get your account disabled there is to be exposed as a pedo.","author":"popeguilty"},{"date":"Thu Oct 13 06:41:38 2011 UTC","comments":"Did you even read the thread? This wasn&#39;t done &quot;for the lulz&quot; it was done <strong>because having a public forum full of pictures of 12 year olds for grown men to wank off to is all kinds of fucked up.<\/strong>","author":"gipp"},{"date":"Thu Oct 13 01:18:17 2011 UTC","comments":"And waited this long to shut it down? Yeah yeah it must be that. Also don&#39;t use the phrase &quot;circle jerking&quot; when discussing this matter.","author":"Whitechip"},{"date":"Thu Oct 13 06:33:43 2011 UTC","comments":"You youngsters hijacking that term, too?  What are we supposed to call it when we form a circle and jerk off?","author":"12characters"},{"date":"Thu Oct 13 01:23:36 2011 UTC","comments":"Is SA worth buying an account for? I&#39;ve been on similar forums and it&#39;s really just a circle jerk of the &quot;e-famous members&quot; (only within that particular website), meme spouting, inside jokes specific to the website, and an &quot;anti-newguy&quot; kind of attitude. In fact, it was basically a frat party full of idiots. Am I wrong in this assumption?","author":"MAC_TRUCK_HITS_BABY"},{"date":"Thu Oct 13 02:20:51 2011 UTC","comments":"SA is a really good forum.  I&#39;ve been a member for ~5 years and have seen and participated in some absolutely unique topics.  Generally the good stuff is in the subforums.\nSA&#39;s main forum, GBS, is filled with judgmental, simple, and very insecure people who hivemind so quickly and eagerly that any differing opinion from what everybody decides is right gets you chastized, sometimes someone pays to change your avatar to something insulting, and you might even get banned.   Just for an opinion.  There <strong>are<\/strong> some great threads in GBS but the regulars are aggressively awful people whose opinions are sometimes formed simply by discerning the opinions of the first two posters in a thread.","author":"Azzmo"},{"date":"Thu Oct 13 04:35:13 2011 UTC","comments":"This is extremely correct and should be upvoted more.\nThe thing is, SA is pretty much the diametrical opposite of places like Reddit and imageboards: both moderation and peer pressure are harsh, intense, and used frequently whenever there is the <em>slightest<\/em> suspicion of low post quality in either form or content. It&#39;s fairly rare to see anyone who&#39;s been a member for several years and who did not get probated at least a few times.\nAll of the above is absolutely awesome for subjects where there can be at least <em>some<\/em> degree of objective consensus; as a result, their forums on tech, arts, food, health, etc. are probably among the best on the Internet (and the one for videogames is almost surely <em>the<\/em> best), because idiots who have no idea what they&#39;re talking about and fanboys whose bias can be seen from Mars are quickly kicked out.\nIt is also, alas, absolute poison for broader discussion. There&#39;s no GBS (&#39;General Bullshit&#39;) equivalent of having professional experience or possessing a lot of technical knowledge on a given subject: what makes an opinion dominant is determined mostly by eloquence and having lots of time to post. Oh, and there&#39;s also the whole &#39;let&#39;s buy someone an avatar with an insult in red text&#39; mechanic which, while easily defeated (it costs twice as much to change someone else&#39;s avatar than yours), is still an incredibly idiotic rule that I have never once seen being funny.","author":"NihilCredo"},{"date":"Thu Oct 13 20:25:23 2011 UTC","comments":"The idea that someone else could change my avatar would be a deal-killer for me.\nI read several pages of the link, and found at least that particular thread on SA to be guilty of the same sort of leaps to judgement, circle-jerking, and self-congratulatory posts I see here on reddit.  I&#39;m sure there are good forums there just as there are here on reddit, but I don&#39;t see anything that tempts me to pay for the privilege of posting there.","author":"darkon"},{"date":"Thu Oct 13 06:39:20 2011 UTC","comments":"Sounds like a royally shitty forum to me.","author":"12characters"},{"date":"Thu Oct 13 07:11:07 2011 UTC","comments":"As long as you discern the difference between the main catchall forum (General Bullshit) and the other 99% of the place you&#39;ll find that it&#39;s a great forum.  And, like I said, GBS does have some amazing threads despite how shitty it is.  ","author":"Azzmo"},{"date":"Thu Oct 13 07:11:09 2011 UTC","comments":"You mustn&#39;t have seen other very shitty forums then :)\nI joined primarily for the games section. <a href=\"http://forums.somethingawful.com/forumdisplay.php?forumid=44\" rel=\"nofollow\">Check it out<\/a>. If you&#39;ve seen a better gaming forum anywhere, I&#39;d <em>love<\/em> to get a link to it; I haven&#39;t found any that come even close, particularly for more niche games (eg. Paradox strategy games).\n(I also haven&#39;t mentioned the comedy threads, which are quite awesome - <a href=\"http://forums.somethingawful.com/showthread.php?threadid=3384692\" rel=\"nofollow\">example<\/a> - but there&#39;s no real reason to join just to browse through those)","author":"NihilCredo"},{"date":"Thu Oct 13 08:44:09 2011 UTC","comments":"I&#39;m severely disillusioned with Reddit over this whole <a href=\"/r/jailbait\">r/jailbait<\/a> thing.  The amount of people who rushed to defend their right to view child porn was staggering.  What does this say to the outside world?  I&#39;ve been reading the Something Awful thread in question all week, and I have to agree with their stance.  This is sickening.","author":"ThisIsMyRedditLogin"},{"date":"Thu Oct 13 12:24:15 2011 UTC","comments":"a picture of myself from when I was fifteen.\nOMG PM ME PLOX","author":"NorthernSkeptic"},{"date":"Thu Oct 13 00:33:58 2011 UTC","comments":"Would you mind going through your post and replacing the bolded parts with the phrase &quot;legal but controversial content?&quot;\nYou might find that your point holds less water when you take the opinion element out of it. There is plenty of content on this website that you probably enjoy that someone else would find offensive; why shouldn&#39;t it <em>all<\/em> be removed?","author":"Slime0"},{"date":"Thu Oct 13 01:57:59 2011 UTC","comments":"Yeah, it&#39;s way easier to justify it if you don&#39;t address the issue of first stealing the images, then secondly intentionally and knowingly posting them to a group devoted to sexualizing children. ","author":"Nigelwethers"},{"date":"Thu Oct 13 07:20:46 2011 UTC","comments":"Are you in opposition to <a href=\"/r/Pics\">r/Pics<\/a> as well, I imagine that very few images there aren&#39;t stolen?","author":"yoda133113"},{"date":"Thu Oct 13 15:52:08 2011 UTC","comments":"My position is that liking the pics on <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> is totally fine, but I still strongly object to what was being done there because the people who originally posted the pics of themselves didn&#39;t intent them to be sexualized.  It&#39;s a kind of a dick move to post them on that particular forum when you know where they came from.","author":"Mousi"},{"date":"Thu Oct 13 16:03:08 2011 UTC","comments":"And that&#39;s fine, I don&#39;t have a logical problem with arguments that what they&#39;re doing is morally wrong (though I do disagree with the argument, think it&#39;s a horrible reason to ban the subreddit, and I&#39;m still opposed to the ban).  However, the people that keep saying that it should be banned because the posters likely didn&#39;t own the photos need to STFU.  This entire site (or at the very least, many very popular subreddits) operates on a system that&#39;s based on reposting pictures that people likely don&#39;t have rights to.","author":"yoda133113"},{"date":"Thu Oct 13 02:44:54 2011 UTC","comments":"I won&#39;t defend stealing images, but I will defend people posting images that are perfectly legal regardless of whether I <em>like<\/em> them or not.","author":"Slime0"},{"date":"Thu Oct 13 15:49:53 2011 UTC","comments":"Jailbait by definition aren&#39;t children.  If they were, they wouldn&#39;t be attractive and no one would post pics of them except mentally sick criminal pedophiles.  What you just said is pure hyperbole.  Try to take a good, sober look at the facts.  If you do that, and still can&#39;t distinguish between the two, you really can&#39;t be helped because you can&#39;t comprehend even the most basic logic.","author":"Mousi"},{"date":"Wed Oct 12 22:36:48 2011 UTC","comments":"Why 12-20? Sexual attraction to 18 to 20 year olds is not only normal it&#39;s also legal. ","author":"memeofconsciousness"},{"date":"Wed Oct 12 23:17:12 2011 UTC","comments":"16-20 year olds in most states in US.","author":"cutter631"},{"date":"Thu Oct 13 15:45:08 2011 UTC","comments":"Yea, the issue is idiots equating a normal thing with another abnormal thing because they can&#39;t comprehend the enormous difference.","author":"Mousi"},{"date":"Wed Oct 12 22:33:13 2011 UTC","comments":"18-20 isn&#39;t jailbait","author":"Mattizzle"},{"date":"Thu Oct 13 05:31:47 2011 UTC","comments":"So could we just not implement a verify system like in GoneWild?\nI can see the argument that some kids were posted without their consent but if consent is given and i saw a few verify post the whats the problem? If they dont verify then take them down just like in GW. \nReddit and the Internet as whole should not bow down and allowed itself to be censor by outside influences, now if there is a vote taken (by redditors) and the motion passes then so be it, but as it stands it sets a dangerous president. \nI still think that this was an attack on Free Press and Free Speech. ","author":"Darkone06"},{"date":"Wed Oct 12 21:51:22 2011 UTC","comments":"There&#39;s nothing in the thread I&#39;m seeing so far that says it was only SA goons who asked for naked pictures of the 14 year old.  Even if an SA good originally offered, that regular jailbait subscribers demanded nudes is one of many proofs that <a href=\"/r/jailbait\">/r/jailbait<\/a> is for pedophiles.\nThe fact is that pre-pubescent girls <em>do<\/em> regularly show up in <a href=\"/r/jailbait\">/r/jailbait<\/a>, and that&#39;s a real problem.  On top of the other problems, such as they&#39;re taking picture of minors and deliberately sexualizing them.","author":"Aerik"},{"date":"Thu Oct 13 05:11:42 2011 UTC","comments":"The fact is that pre-pubescent girls do regularly show up in <a href=\"/r/jailbait\">/r/jailbait<\/a>\nBullshit, I was a mod there for over a year, I saw only a couple of posts that were of pre-pubescent girls and they were removed.","author":"FillInTheBlank"},{"date":"Wed Oct 12 22:51:14 2011 UTC","comments":"*ephebophiles","author":"heart-on"},{"date":"Thu Oct 13 02:24:01 2011 UTC","comments":"Illegal where? There are many different laws in many different states and countries. Who is right? Is it 18?  Is it 16? Who fucking knows.  It&#39;s too gray of a topic which is probably why it makes such a great debate. ","author":"BiggiesOnMyShorty"},{"date":"Thu Oct 13 01:38:23 2011 UTC","comments":"yeah, teens are infants. you&#39;re right!","author":"heart-on"},{"date":"Thu Oct 13 05:12:59 2011 UTC","comments":"Did he fucking say that they were infants?","author":"Gnarwhalrus"},{"date":"Thu Oct 13 02:18:39 2011 UTC","comments":"that&#39;s cool. i&#39;m talking about ephebophiles vs. pedophiles, not the <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> subreddit.","author":"heart-on"},{"date":"Thu Oct 13 02:01:05 2011 UTC","comments":"Which is statutory rape, sexual misconduct with a minor, soliciting a minor, etc. not pedophilia. So even legally you are still incorrect.","author":"JustinTime112"},{"date":"Thu Oct 13 03:27:10 2011 UTC","comments":"You&#39;re right, because it is <strong>LEGAL<\/strong> to have sex with 16 year olds in:\nAlabama, Alaska, Arkansas, Connecticut, District of Columbia, Georgia, Hawaii, Indiana, Iowa, Kansas, Kentucky, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Montana, Nevada, New Hampshire, New Jersey, North Carolina, Ohio, Oklahoma, Pennsylvania, Rhode Island, South Carolina, South Dakota, Vermont, Washington, West Virginia\nAt 17:\nColorado, Illinois, Louisiana, Missouri, Nebraska, New Mexico, New York, Texas, Wyoming\nSo yes, there are 11 states where Jailbait sex is by definition illegal. ","author":"throwthisidaway"},{"date":"Thu Oct 13 00:13:40 2011 UTC","comments":"<code>*<\/code> pedophiles with thesauruses","author":"Aerik"},{"date":"Thu Oct 13 02:00:10 2011 UTC","comments":"Fuck people like you for making actual pedophiles look good. We are biologically designed to be attracted to sexually mature human beings, many people find they are interested in teenagers and many teenagers believe it or not possess a sexuality.\nReal pedophile rapists are monsters, they are life destroyers who prey on actual children. Every time you call an ephebophile a pedophile you are making the term &#39;pedophile&#39; conjure up less and less disgust. They <em>deserve<\/em> that disgust.","author":"JustinTime112"},{"date":"Thu Oct 13 02:32:11 2011 UTC","comments":"I honestly think there is a difference; there really is. There is a huge difference between someone attracted to prepubescent 8yr olds and those attracted to fully developed 16yr olds. But... it it still wrong to perv on teenage girls. They may be physically developed, but not mentally developed. They are still pretty much children when it comes to their mental state, which is why it&#39;s wrong to post salacious and partly nude photos of them to be rated and fapped to. ","author":"marvelgirl"},{"date":"Thu Oct 13 02:40:09 2011 UTC","comments":"Child molesters deserve disgust, revile, and incarceration, not people who are attracted to children but don&#39;t act on their impulses. I don&#39;t understand their attraction either but you can&#39;t condemn people with, say, rape fantasies and call for their heads because you may think they are more inclined to actually rape someone.  ","author":"facebookcreepin"},{"date":"Thu Oct 13 02:53:16 2011 UTC","comments":"if being attracted to a 17 year old with huge tits isn&#39;t normal then i don&#39;t know what is. there, i said it.","author":"AvidWikipedian"},{"date":"Thu Oct 13 01:59:02 2011 UTC","comments":"The difference is a moot point since they&#39;re both underage. Bringing it up is just pointless pedantry that everyone&#39;s tired of.","author":"1338h4x"},{"date":"Wed Oct 12 23:18:02 2011 UTC","comments":"But now you know it yourself!","author":"frogofthebucket"},{"date":"Wed Oct 12 23:39:32 2011 UTC","comments":"Everybody over here!!! Here&#39;s another one let&#39;s get him!!!","author":"No_Pants_No_Problems"},{"date":"Wed Oct 12 23:19:19 2011 UTC","comments":"That was the most immature comment I&#39;ve ever heard. I&#39;m 16 and like looking at pictures of girls the same age as me, does that make me a &quot;pedophile&quot;?","author":"thegillenator"},{"date":"Wed Oct 12 23:50:03 2011 UTC","comments":"ephebo = liking girls going through puberty\nNo, it&#39;s girls between puberty and adulthood. Also, everyone is hard wired to like them. Ephebophiles <em>prefer<\/em> them.","author":"znine"},{"date":"Thu Oct 13 16:13:28 2011 UTC","comments":"If someone actually prefers them over adult women, I think that&#39;s weird.  If someone likes them, among other age groups, I guess that&#39;s fine.  But seriously, do the users of <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> just like jailbait or do they like them in addition to other females? Because I find it so hard to believe.  I guess we&#39;ll never know unless we do some sort of poll...","author":"Mousi"},{"date":"Wed Oct 12 20:14:17 2011 UTC","comments":"SomethingAwful did something good.","author":"badcomment"},{"date":"Wed Oct 12 22:25:57 2011 UTC","comments":"Furries better tread carefully, if I recall correctly SA is not terribly fond of them either.","author":"Taibo"},{"date":"Thu Oct 13 00:08:50 2011 UTC","comments":"OH no! <a href=\"http://reddit.com/r/furry\">/r/furry<\/a> is going to get shut down! \n<a href=\"http://www.youtube.com/watch?v=nF_lJTGKFP0&amp;feature=related\">Noooooooooooooooooooooooooooooooooo!<\/a>","author":"evilsibe"},{"date":"Thu Oct 13 00:38:38 2011 UTC","comments":"I was pleasantly surprised to discover this link was not what I expected!","author":"revdrviking"},{"date":"Thu Oct 13 07:19:48 2011 UTC","comments":"Is that... Elijah Wood?\nWhy does my brain do this to me? WHY?","author":"Reddicator"},{"date":"Wed Oct 12 23:35:27 2011 UTC","comments":"whats furries? i&#39;m not going to search for something i know nothing about, made that mistake too many times.","author":"Honey-Badger"},{"date":"Wed Oct 12 23:51:40 2011 UTC","comments":"Fandom of people who like cartoon/anthropomorphic animals. Just happens to contain a lot of porn because humans are sexual creatures and like turning interests into fetishes, but it&#39;s not all porn. ","author":"dreamendDischarger"},{"date":"Thu Oct 13 01:40:22 2011 UTC","comments":"<a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/FurryFandom\" rel=\"nofollow\">Informative information.<\/a>","author":"puppymeat"},{"date":"Wed Oct 12 23:13:25 2011 UTC","comments":"Fuck censorship and fuck you.","author":"mindbleach"},{"date":"Wed Oct 12 22:27:58 2011 UTC","comments":"Astroturfing is killing reddit. Sockpuppets need to be outlawed. One account per IP, or some type of anti-astroturfing measures are needed I believe.","author":"bceagles"},{"date":"Wed Oct 12 23:26:58 2011 UTC","comments":"One account per IP\nWhy do you hate Qatar?","author":"AlyoshaV"},{"date":"Wed Oct 12 23:35:31 2011 UTC","comments":"Is the entire country of Qatar really on one IP? How?","author":"afschuld"},{"date":"Wed Oct 12 23:38:27 2011 UTC","comments":"Only one ISP and all traffic goes through a filtering proxy.\n<a href=\"http://i.imgur.com/vkKq8.png\">http://i.imgur.com/vkKq8.png<\/a>\n<a href=\"http://news.bbc.co.uk/2/hi/technology/6224677.stm\">http://news.bbc.co.uk/2/hi/technology/6224677.stm<\/a>","author":"AlyoshaV"},{"date":"Thu Oct 13 00:01:02 2011 UTC","comments":"Facinating. My university has over 25,000 ips just for one campus. I dont know how an entire (very wealthy) nation can get by with just one.","author":"afschuld"},{"date":"Thu Oct 13 00:13:16 2011 UTC","comments":"It&#39;s only one external. The entire country runs through a proxy, apparently. So they must be doing some kind of subnet allocation to the users.","author":"SheeEttin"},{"date":"Thu Oct 13 02:22:40 2011 UTC","comments":"So, if you&#39;re banned from a message board, everyone in Qatar is banned?","author":"myfriendintime"},{"date":"Thu Oct 13 07:56:59 2011 UTC","comments":"Because Abdullah al-Attiyah ran over my dog!","author":"Anosognosia"},{"date":"Thu Oct 13 15:51:12 2011 UTC","comments":"TIL there are a lot of <em>butt-hurt<\/em> pedophiles on Reddit.  Bravo Goons.","author":"dcpeon"},{"date":"Thu Oct 13 19:39:55 2011 UTC","comments":"I like Reddit, but violentacrez is fucking scum. Purely the fact that he&#39;s so popularly makes me want to stop coming here sometimes.","author":"cakevagina"},{"date":"Thu Oct 13 08:03:05 2011 UTC","comments":"Good job SomethingAwful,that subreddit was a tumor that needed to be removed.","author":"CaptainPower"},{"date":"Thu Oct 13 00:48:38 2011 UTC","comments":"&quot;The moderator of Jailbait, violentacrez is a 48 year old man who has publicly admitted to performing oral sex on his stepdaughter. In addition to starting/moderating many of the jailbait subreddits, he also moderates subreddits for young celebrities like Elle Fanning, who is 13 years old. He also moderates the Reddit incest forum, as well as several shock subreddits such as BabyFellatio, PicsOfDeadJailbait, PicsOfDeadKids, rape, and rapebait.&quot;\nAh, yes, this is who you should be defending Reddit. Just solid reasoning there. ","author":"sodajonesx"},{"date":"Thu Oct 13 01:25:50 2011 UTC","comments":"who has publicly admitted to performing oral sex on his stepdaughter.\nProof?","author":"bluequail"},{"date":"Thu Oct 13 02:29:24 2011 UTC","comments":"<a href=\"http://www.reddit.com/r/IAmA/comments/c5866/by_request_i_am_reddits_creepy_uncle_violentacrez/c0q6xfd\">She moved back in with us when she was 19, we smoked pot together, she got frisky, there was some motorboating, I went down on her, several orgasms later, she decided she liked it, and it happened a few more times (until Mom found out)<\/a>.\nAnd get this, that particular comment got <em>88 upvotes<\/em>! He seemed to be a really popular guy as of 1 year ago, lol!","author":"Grammar-Hitler"},{"date":"Thu Oct 13 02:47:54 2011 UTC","comments":"Eh - while falling into the boundaries of distasteful to me, she was legally an adult.\nHe has always been a good friend to me, and I am not going to judge him at any level.  I don&#39;t go into the subreddits that I find in poor taste.\nBy the way thank you so much for taking the time and trouble to link that.  I don&#39;t think I would have believed it otherwise, but now I have no choice, but to believe it.  Actually it wasn&#39;t as bad as I had originally feared.<blockquote>\nHe seemed to be a really popular guy as of 1 year ago, lol!\nActually he is a really popular guy on here now. And he has always conducted his self with utmost integrity with me, but that could be because I am old and grumpy.  :)","author":"bluequail"},{"date":"Thu Oct 13 03:41:18 2011 UTC","comments":"By the way thank you so much for taking the time and trouble to link that\nHow could I <em>not<\/em> follow up on such an interesting accusation?  Especially when my first thought was: &quot;hrmmm, if that were true, shouldn&#39;t he be in jail by now&quot;?<blockquote>\n&quot;The moderator of Jailbait, violentacrez is a 48 year old man who has publicly admitted to performing oral sex on his stepdaughter. In addition to starting/moderating many of the jailbait subreddits, he also moderates subreddits for young celebrities like Elle Fanning, who is 13 years old. He also moderates the Reddit incest forum, as well as several shock subreddits such as BabyFellatio, PicsOfDeadJailbait, PicsOfDeadKids, rape, and rapebait.&quot;\nI love how this quote uses nothing but facts to tell a lie.  Any red-blooded american (like myself) who reads this quote will come to the conclusion that the guy raped his stepdaughter when she was underage.  I mean, we&#39;ve all seen at least a dozen nauseating 6&#39;o&#39;clock news stories about similar acts.  Now, while this guy is certainly creepy and weird, he didn&#39;t break any laws with his stepdaughter, something you would clearly take away from that quote.  I think that plain-old lying is like level 1 deception, but stuff like this, using facts and ambiguity to cause the listener to assume something that is a lie, that&#39;s like level 5 deception.    ","author":"Grammar-Hitler"},{"date":"Thu Oct 13 04:11:41 2011 UTC","comments":"And being it was 16 years ago, that would have only put him at 35 years old when it happened.  I&#39;ve seen marriages with a greater span in them than a 19 year old with a 35 year old.\nI wonder if the mom ever forgave the daughter.","author":"bluequail"},{"date":"Thu Oct 13 04:13:44 2011 UTC","comments":"I&#39;m sure she did, it&#39;s not like he ever managed to get his penis inside of her or anything...in a way...he was <em>used<\/em>.","author":"Grammar-Hitler"},{"date":"Thu Oct 13 03:31:04 2011 UTC","comments":"Thanks for finding this for me I didn&#39;t have it in me to actually search for the direct link. ","author":"sodajonesx"},{"date":"Thu Oct 13 05:52:54 2011 UTC","comments":"TIL <a href=\"/r/jailbait\" rel=\"nofollow\">/r/jailbait<\/a> moderator ViolentAcrez is 48, and has admitted to having a sexual relationship with his 19 year old daughter with her mother knowledge.\n<a href=\"http://www.reddit.com/r/IAmA/comments/c5866/by_request_i_am_reddits_creepy_uncle_violentacrez/c0q6yuf\" rel=\"nofollow\">http://www.reddit.com/r/IAmA/comments/c5866/by_request_i_am_reddits_creepy_uncle_violentacrez/c0q6yuf<\/a>","author":"YourFuckinRetarded"},{"date":"Thu Oct 13 08:37:10 2011 UTC","comments":"step daughter.","author":"rmhuntley"},{"date":"Thu Oct 13 23:14:58 2011 UTC","comments":"Yeah, that&#39;s much less creepy... &#3232;","author":"ConcernedCyclops"},{"date":"Thu Oct 13 23:59:36 2011 UTC","comments":"As long as it&#39;s between to consenting adults, I could care less. it&#39;s not my cup of tea, but to each their own.","author":"rmhuntley"},{"date":"Fri Oct 14 03:10:43 2011 UTC","comments":"&quot;TIL that an adult had consensual oral sex with another biologically-unrelated adult&quot;.\nStop the presses!","author":"Defenestresque"},{"date":"Thu Oct 13 00:00:27 2011 UTC","comments":"I am happy this got shut down. Don&#39;t care what the opinion is. Free Speech crosses a line when it invades the privacy of minors. Especially minors that don&#39;t know their picture was taken and posted on the internet for the sexual gratification of others. That&#39;s fucking sick.\nAlso, does it matter if they have clothes on? It was posted in a subreddit for the sexual gratification of people on the internet. An organized feed of user submitted suggestively clothed minors is disgusting. How can there be people that support that subreddit?","author":"xamboozi"},{"date":"Thu Oct 13 03:03:51 2011 UTC","comments":"not thrilled that it was shut down, but this is not a free speech issue.  free speech means govt cant squelch you; owners of establishments damn well can stop your speech on their property  ","author":"wolfsktaag"},{"date":"Thu Oct 13 04:46:57 2011 UTC","comments":"It absolutly is a free speech issue, it just doesn&#39;t revolve around the first amendment. The issue is that <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> wasn&#39;t doing anything explicitly illegal, and thus was banned on moral grounds. That means that the admins of reddit are now making conscious decisions on what is and isn&#39;t moral enough to stay on reddit.\nIf <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> was constant nudes of underage girls, then shut it down, but it was one thread that was apparently being invaded by an outside website to distribute illegal materials outside of <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a>.","author":"NovaDeez"},{"date":"Thu Oct 13 05:30:14 2011 UTC","comments":"<a href=\"http://www.reddit.com/r/reddit.com/comments/l9wuw/remember_that_jailbait_thread_with_users_begging/c2r02hq\">This is a really relevant comment.<\/a>\nNudity is not necessary for it to be illegal.  Suggestive poses in the pictures make it <a href=\"http://nerdmeltla.com/wp-content/uploads/2011/08/the-more-you-know1.jpg\">illegal.<\/a>","author":"JEveryman"},{"date":"Thu Oct 13 04:49:33 2011 UTC","comments":"generally when people talk about free speech, they are referring to the first amendment.  my assumption is that is what xamboozi meant  ","author":"wolfsktaag"},{"date":"Thu Oct 13 01:45:39 2011 UTC","comments":"So basically, &#39;fuck free speech except when I don&#39;t like it&#39;","author":"Ag-E"},{"date":"Thu Oct 13 02:20:44 2011 UTC","comments":"No, fuck free speech if your using it to fap to little girls.","author":"xamboozi"},{"date":"Thu Oct 13 02:06:10 2011 UTC","comments":"I (a teen) have shirtless pics of myself on my myspace somewhere. I put those up publicly and am fully aware people other than my friends will be looking at them. If I put up pictures of myself on the internet publicly, then why should I get mad if people use them?\nBesides, if that was your whole rationale then we should ban <a href=\"/r/adviceanimals\" rel=\"nofollow\">r/adviceanimals<\/a> because I certain the people in their meme pictures did not give permission to be &quot;Idiot Nerd Girl&quot; or &quot;Clueless College Freshmen&quot;. Or a lot of <a href=\"/r/pics\" rel=\"nofollow\">r/pics<\/a> as well. I am pretty sure you are just applying this arbitrarily because this particular subreddit had (legal) content you don&#39;t approve of.","author":"JustinTime112"},{"date":"Thu Oct 13 02:20:11 2011 UTC","comments":"If you&#39;re under 18, then this is one fucked up comment.","author":"xamboozi"},{"date":"Thu Oct 13 01:54:23 2011 UTC","comments":"Jeez they love themselves don&#39;t they? Still jailbait was the anus of reddit so whatever.","author":"micksb"},{"date":"Thu Oct 13 13:03:34 2011 UTC","comments":"Ah somethingaweful... the <em>original<\/em> internet hate machine. well played ol&#39;chaps!","author":"SOLIDninja"},{"date":"Thu Oct 13 02:44:45 2011 UTC","comments":"Alright, here&#39;s my manifesto on this whole jailbait controversy: there is nothing wrong morally, ethically, psychologically, or otherwise with finding sexually mature girls (ie girls who have gone through puberty) to be attractive. On the most basic level, our minds see a fertile potential mate, and we desire them. We don&#39;t differentiate, on this primal level, between 15 years old and 18 years old. We see the potential for childbearing, or lack thereof. \nI, as a 17 year old male, visited <a href=\"/r/jailbait\">r/jailbait<\/a> from time to time. I happen to find sexually mature girls in my own age range to be attractive. That doesn&#39;t make me a pedophile. That said, there was definitely a &quot;too young&quot; line that always made me really uncomfortable when crossed. It was never attached to a number, though, but rather sexual maturity. Of course, this is much too fuzzy a line to make laws on, we have to have an objective standard to draw the line by, and the best way to do that is age in years. Laws must be cut and dry. Morality rarely, if ever, is.The other issue is the candid pictures that are so frequently posted to <a href=\"/r/jailbait\">r/jailbait<\/a>. I find that taking sexually suggestive pictures, and proceeding to distribute them to a massive audience, is entirely morally reprehensible, regardless of the subject&#39;s age.\nFor me, when you come down to it, it&#39;s a censorship issue. I&#39;ll go ahead and be the 99th person to express the fact that I understand that reddit is privately owned, and not subject to the ideals laid out in the constitution. But they still have a set of ideals of their own, that are defined by their actions. Banning of <a href=\"/r/jailbait\">r/jailbait<\/a> sets a precedent for future censorship. Next, as many others could be <a href=\"/r/trees\">r/trees<\/a>. Then perhaps things like hate speech, et cetera. Basically, you are faced with the question of where to draw the line. As another redditor put it, once you decide to eliminate or ban some content, you are responsible for literally everything that you didn&#39;t. I&#39;d rather deal with creeps and racists and even the Phelps-Roepers of the world, because the alternative is someone else dictating what I can and can&#39;t say./manifesto\nDamn, that turned out longer than I thought. It&#39;s probably all been said before, and more eloquenly, but I felt the need to toss in my two cents. If you read this far, thanks, it means a lot.","author":"Jpot"},{"date":"Thu Oct 13 07:06:42 2011 UTC","comments":"Next, as many others could be <a href=\"/r/trees\" rel=\"nofollow\">r/trees<\/a>.\nDoing drugs does not <em>require<\/em> unethical behavior. Posting pictures obtained through less-than-noble means <em>is<\/em> arguably unethical.  I.e. there are arguments for the continued existence of things like <a href=\"/r/trees\" rel=\"nofollow\">/r/trees<\/a> (no harm done, directly or indirectly) that proponents of <a href=\"/r/jailbait\" rel=\"nofollow\">/r/jailbait<\/a> and the like cannot make (lack of consent = unethical, please argue somewhere else about whether underage people can give consent to be used as masturbatory material). Shutting down <a href=\"/r/jailbait\" rel=\"nofollow\">/r/jailbait<\/a> sets a precedent, yes, but only for the shutting down of the rest of the /r/*bait subreddits.","author":"kftrendy"},{"date":"Thu Oct 13 01:58:30 2011 UTC","comments":"Why do people still care about non-threaded forums? I mean seriously, your shit is whack SA. vBulletin makes my eyes bleed.","author":"japov"},{"date":"Thu Oct 13 00:11:33 2011 UTC","comments":"Well played, Goons. \nI&#39;m not an advocate for censorship but sometimes people are just fucking broken and need to be taken to hand for being dirty creepers, like <a href=\"/r/jailbait\">/r/jailbait<\/a>. It&#39;s just a shame that it took the hand of an external source to kill that reddit. \nThat people are trying to justify the existance of <a href=\"/r/jailbait\">/r/jailbait<\/a> with that &quot;clothes are on&quot; arguement is just insulting. Those photos weren&#39;t being posted for fashion or artistic critique. There was some sick shit being done to children in the minds of some really broken people. I don&#39;t accept that justification, or understand why people would openly whiteknight on behalf of these kinds of people under the pretense of &quot;freedom of speech&quot;. ","author":"Supermenace"},{"date":"Thu Oct 13 13:41:53 2011 UTC","comments":"Do you have the same feelings about <a href=\"/r/BeatingWomen\" rel=\"nofollow\">/r/BeatingWomen<\/a> and <a href=\"/r/PicsOfDeadKids\" rel=\"nofollow\">/r/PicsOfDeadKids<\/a>?","author":"Almalexia"},{"date":"Thu Oct 13 00:50:26 2011 UTC","comments":"I won&#39;t downvote you, but get a hobby and stop worrying about what is going on in other people&#39;s minds.","author":"xebo"},{"date":"Thu Oct 13 03:54:30 2011 UTC","comments":"I&#39;m sorry but in this case it&#39;s well beyond people&#39;s minds, resulting in a structured location for the posting of stolen images of underage girls with the express purpose of sexual gratification.","author":"Nigelwethers"},{"date":"Wed Oct 12 22:16:16 2011 UTC","comments":"The CP thing wasn&#39;t cool. Take it to 4chan. As far as <a href=\"/r/jailbait\">/r/jailbait<\/a> goes though, I have/had no problem with it. It&#39;s not illegal nor immoral. Whatever... reddit isn&#39;t a government and doesn&#39;t guarantee rights or anything, but where do we draw the line in taking down subreddits? Why can&#39;t we have <a href=\"/r/jailbait\">/r/jailbait<\/a> but still have <a href=\"/r/deadbabies\">/r/deadbabies<\/a>, <a href=\"/r/beatingwomen\">/r/beatingwomen<\/a>, or <a href=\"/r/PicsOfDeadKids\">/r/PicsOfDeadKids<\/a>?","author":"MetalGuitarist"},{"date":"Thu Oct 13 00:47:41 2011 UTC","comments":"4chan mods are actually really good about permabaning anyone who posts CP almost the instant it is posted.  I don&#39;t understand why people have this misconception that 4chan is this place where illegal things can be posted with no repercussions.  4chan may be illiterate and ignorant as fuck, but reddit as a whole has a lot darker shit posted, especially considering reddits like <a href=\"/r/picsofdeadkids\">r/picsofdeadkids<\/a>, compared to 4chan as a whole.  ","author":"shoutoutspencer"},{"date":"Thu Oct 13 06:43:16 2011 UTC","comments":"don&#39;t understand why people have this misconception that 4chan is this place where illegal things can be posted with no repercussions.\nBecause back in the day it <em>was<\/em>. A few years back CP threads were quite common on 4chan, it wasn&#39;t until it started attracting huge attention that the mods got serious about banning people for it.","author":"Crioca"},{"date":"Thu Oct 13 01:30:06 2011 UTC","comments":"Considering the sheer amount of traffic the site gets, It&#39;s actually impressive that they&#39;re able to be so responsive. ","author":"Ch4rd"},{"date":"Thu Oct 13 01:58:01 2011 UTC","comments":"Mods are considerably involved with the proper government groups.  I believe they report any IP address posting CP or anything of the like to the proper authorities.  ","author":"shoutoutspencer"},{"date":"Wed Oct 12 23:03:58 2011 UTC","comments":"Then how do all the damn teen model sites that are based in the US get away with it?","author":"psyon"},{"date":"Thu Oct 13 04:49:01 2011 UTC","comments":"Damn, I thought we might finally have some ammo for use against Toddlers and Tiaras.","author":"rabblerabble2000"},{"date":"Thu Oct 13 00:03:30 2011 UTC","comments":"They key thing is focusing on the genitals, most JB I&#39;ve seen (not that I&#39;m a purveyor) is scene-girl myspace self-shots that maybe shows a little side boob, and I don&#39;t think that is what they mean by genitals. \nedit: If you read the <a href=\"http://scholar.google.com/scholar_case?case=9482047682589425170&amp;hl=en&amp;as_sdt=10000000000002&amp;as_vis=1\">Dost case-law<\/a> you will see that I am correct. ","author":"neurorootkit"},{"date":"Thu Oct 13 00:21:28 2011 UTC","comments":"If facebook photos of teens = illegal child pornography. Then the creators of said child pornography should be charged as child pornographers. Correct? You&#39;re implying that we should send these children to jail for taking pictures of themselves and others. ","author":"alphanon"},{"date":"Thu Oct 13 01:58:44 2011 UTC","comments":"He is neither arguing that the law makes sense nor that it is consistently applied. He is just stating what the law is and what precedent exists. This isn&#39;t a call for action, it&#39;s just a statement that action could happen against reddit on well-established legal grounds. ","author":"wren5x"},{"date":"Wed Oct 12 23:54:56 2011 UTC","comments":"Except we can&#39;t arrive at a quantifiable definition for any of those six criteria except #4.","author":"Sylocat"},{"date":"Wed Oct 12 22:47:29 2011 UTC","comments":"So facebook should be illegal in your opinion, no?\nMost of the pics on <a href=\"/r/jailbait\">/r/jailbait<\/a> I&#39;ve seen (I never visited there much, maybe twice in my 3 months here) were just of girls in bikini&#39;s on the beach or something. Under those definitions, it wouldn&#39;t be illegal. Some of those guidelines are able to be differently interpreted as well, specifically number 6 there.","author":"MetalGuitarist"},{"date":"Thu Oct 13 13:38:29 2011 UTC","comments":"I don&#39;t understand why jailbait was shut down and PicsOfDeadKids hasn&#39;t been taken down. It&#39;s like, &quot;Well, we can let reddit be associated with pictures of dead children and babies, but we can&#39;t have people thinking people on reddit look at pictures of clothed teens!&quot; It&#39;s a ridiculous double standard.","author":"Almalexia"},{"date":"Thu Oct 13 01:20:22 2011 UTC","comments":"if you found a pic of your daughter\nI don&#39;t think that is a good argument, because if you found a pic of your 18+ daughter you would likely have the same reaction.","author":"totalBIC"},{"date":"Thu Oct 13 00:40:07 2011 UTC","comments":"And you don&#39;t even know if they&#39;re doing what you say they&#39;re doing.","author":"riotlancer"},{"date":"Thu Oct 13 00:18:41 2011 UTC","comments":"It&#39;s not immoral. That&#39;s the thing. You are applying morality to things going on in someone&#39;s imagination.","author":"stevejoobs"},{"date":"Thu Oct 13 00:37:32 2011 UTC","comments":"There is tons of immoral shit on Reddit. Who is the judge of what goes too far? Now that Reddit has shown that they will censor immoral things shouldn&#39;t they ban <a href=\"/r/deadbabies\">/r/deadbabies<\/a>, <a href=\"/r/beatingwomen\">/r/beatingwomen<\/a>, and <a href=\"/r/PicsOfDeadKids\">/r/PicsOfDeadKids<\/a>?\nI could make the argument that they must find /jailbait worse than the above because they didn&#39;t ban those.\nWhat about <a href=\"/r/drugs\">r/drugs<\/a>? Is that immoral? They talk about hard drugs in there! Is <a href=\"/r/trees\">r/trees<\/a> ok?<blockquote>\nImagine if you found a pic of your daughter on <a href=\"/r/jailbait\">/r/jailbait<\/a>.\nIf I found an immoral picture of my daughter being shared anywhere on the internet it would be the fault of the person who found and shared the picture, and maybe also my daughter for taking and uploading the picture. It would not be the fault of whatever website the photo happens to be on at the time.","author":"Gravedigger3"},{"date":"Wed Oct 12 22:24:05 2011 UTC","comments":"And even the CP thing was a raid from another site. /JB/ was actually pretty above-board until then.","author":"JesusWasABlackMan"},{"date":"Thu Oct 13 02:24:27 2011 UTC","comments":"Did you even read what they said? At all?  It was <em>never<\/em> said &quot;Ask for CP in PM so we can set them up&quot;.  The organized, raid if you will, having their users report the asking for CP, and the community itself, to the proper authorities and media.","author":"Pudie"},{"date":"Thu Oct 13 01:15:03 2011 UTC","comments":"I think places like <a href=\"/r/asianjailbait\">r/asianjailbait<\/a> and others just like it are still up and running. I don&#39;t think the problem will ever be resolved, even if Reddit shuts them down too, just swept under the rug further where they split into smaller subreddits that aren&#39;t that big in visitors and don&#39;t draw a lot of attention.","author":"nanowerx"},{"date":"Thu Oct 13 00:24:31 2011 UTC","comments":"well he did say stare... nothing more... :|","author":"ehrik"},{"date":"Thu Oct 13 02:07:12 2011 UTC","comments":"There was actually a study that said just this.\nVideogames lower violence rates because they&#39;re too busy playing the games, heh.","author":"Quazz"},{"date":"Thu Oct 13 04:22:25 2011 UTC","comments":"I would love a link if you have it.","author":"browb3aten"},{"date":"Thu Oct 13 02:02:58 2011 UTC","comments":"So strict the CP thread remained up for 10 hours before finally getting pulled.","author":"1338h4x"},{"date":"Wed Oct 12 23:42:57 2011 UTC","comments":"That&#39;s a nice daughter you have there.\nIt&#39;d be a shame if something... <em>happened<\/em> to her.","author":"AlyoshaV"},{"date":"Wed Oct 12 23:33:50 2011 UTC","comments":"Haha what?","author":"afschuld"},{"date":"Thu Oct 13 00:39:08 2011 UTC","comments":"will go hang out at the local swimming pool so they can stare at your daughter in real life.\nIsn&#39;t this the most ironic thing about the CP discourse?  It&#39;s wrong because it can be exploitative and psychologically damaging to the child to discover that their pictures are being used in such a way - a potential violation of their privacy; while getting rid of it means that the viewers must get more directly involved with the subjects in order to pursue their fetish - which could easily lead to more exploitative and psychologically damaging experiences for the child.  \nI&#39;m not passing judgement against nor defending pedophiles or ephebophiles or whatever the term is, it&#39;s just an observation that struck me.","author":"my_own_wakawaka"},{"date":"Thu Oct 13 01:17:13 2011 UTC","comments":"I would add to that though, if you want to use this line of reasoning, you also have to include the one that leads to:\nIf there&#39;s a higher demand, there will be higher production, therefore by watching/distributing, they are increasing the actual abuse.\nSo, really you&#39;re doing both good and harm by outlawing it and by allowing it.","author":"totalBIC"},{"date":"Thu Oct 13 01:24:07 2011 UTC","comments":"That&#39;s one of the arguments that keeps possession legal in Japan.","author":"Ch4rd"},{"date":"Thu Oct 13 03:25:27 2011 UTC","comments":"An observation with no basis in reality. You&#39;d have to do some serious qualifying to show any relationship between getting rid of CP and a rise in physical abuse.\nBecause as it stands you make it sound like you can either eliminate on or the other, which is not a tenable stance on the matter.","author":"Nigelwethers"},{"date":"Wed Oct 12 23:59:08 2011 UTC","comments":"It is not reddit&#39;s job to make value-judgments about submitted content. If something is blatantly illegal/an immediate threat and so on, the proper authorities should be notified. Otherwise, it&#39;s more appropriate to just yell at the <a href=\"/r/jailbait\" rel=\"nofollow\">r/jailbait<\/a> posters&#39; parents for doing a shitty job raising their creepy kids.","author":"parsac58"},{"date":"Thu Oct 13 08:58:22 2011 UTC","comments":"good for them, they did something good for reddit by getting that place closed.","author":"derpderpin"},{"date":"Wed Oct 12 23:37:23 2011 UTC","comments":"Why do people have a problem with that section being shut down? It was downright disgusting. Just imagine your child or sibling being posted on there with people commenting about how hot they are. C&#39;mon people. ","author":"My_College"},{"date":"Thu Oct 13 04:00:13 2011 UTC","comments":"Just imagine your child or sibling being posted on there with people commenting about how hot they are.\nOK, I imagined it. Now what? Is that supposed to be bad? Who gives a fuck?\nYou people are complaining about <em>thought crimes<\/em>. It&#39;s fucking scary.\nThe problem with <em>actual<\/em> child porn is that children are victimized to produce it. If some girl posts pictures of herself on the Internet, she is not victimized by the thoughts of strangers. Sorry, but that&#39;s not how reality works.","author":"EricTboneJackson"},{"date":"Wed Oct 12 23:44:04 2011 UTC","comments":"I fully support reporting pedos to the proper authorities, but the comments about how SA will be discussed in history books of the next century as the saviors of the internet and the like, were hard to stomach. SA, 4chan, reddit, etc. all have shitty and cool elements to them. To suggest one is better than another is somewhat ridiculous. Except for Digg, Digg sucks.","author":"parsac58"},{"date":"Thu Oct 13 00:04:45 2011 UTC","comments":"<a href=\"/r/jailbait\">/r/jailbait<\/a> was a good example of &quot;in theory&quot; free speech colliding with &quot;in reality&quot; free speech.\nI&#39;m glad &quot;in reality&quot; prevailed, because that&#39;s where me and all my stuff live.","author":"glonq"},{"date":"Thu Oct 13 02:32:43 2011 UTC","comments":"I thought it was weird. The other threads had like 20 posts at the most, and that <em>one<\/em> thread had over a 150.","author":"emkat"},{"date":"Thu Oct 13 02:37:36 2011 UTC","comments":"Impressive troll. Pretty douchebaggish, but still, impressive.","author":"supergauntlet"},{"date":"Thu Oct 13 08:01:36 2011 UTC","comments":"<em>slow clap<\/em>","author":"Wordwench"},{"date":"Thu Oct 13 08:08:53 2011 UTC","comments":"<a href=\"http://i.imgur.com/AYp1Z.jpg\" rel=\"nofollow\">Trolling is a Art<\/a>","author":"THE_NO_LIFE_KING"},{"date":"Thu Oct 13 09:44:35 2011 UTC","comments":"I get why therye raggin on us for /jailbait and tbh were better off without it (its a bit of a grey area) but whats with the rest of the stuff were being ragged on for, wheres teh love?","author":"helin0x"},{"date":"Thu Oct 13 18:04:02 2011 UTC","comments":"I have a clue this part of reddit existed till Anderson Cooper made a big deal about it.  As a rational and sane man, I am very glad this area of the site is gone.  But on the other hand, I don&#39;t like president this will set.  Next time a part of reddit becomes nationally controversial, what will happen then?","author":"DongleNocker"},{"date":"Thu Oct 13 20:31:34 2011 UTC","comments":"Am I the only person who has no idea what this goon thing is? ","author":"BigOrangeBall"},{"date":"Sun Oct 16 13:15:57 2011 UTC","comments":"SomethingAwful is the cool place to hang out. You can find most of the cool people there. In SA you can just chill and do whatever and totally relax. &quot;Take it easy&quot; is the SA motto, for example, that&#39;s how laid back it is there. Show up if you want to have a good time. Another good reason to show up is if you want to hang out with friends.","author":"Amanda_Hugnkiss"},{"date":"Thu Oct 13 05:00:01 2011 UTC","comments":"I have never been more proud to be a goon.","author":"RyenDeckard"},{"date":"Thu Oct 13 10:02:47 2011 UTC","comments":"TIL Somethingawful still exists","author":"bl4ckduck"},{"date":"Wed Oct 12 23:05:23 2011 UTC","comments":"I don&#39;t even have to read the article, it is obvious now all you need to shut down a subreddit is several alt accounts and TOR/VPN tunneling network. ","author":"neurorootkit"},{"date":"Thu Oct 13 05:32:04 2011 UTC","comments":"They didn&#39;t request the nude pictures, they reported it to the Feds and Anderson Cooper.","author":"JEveryman"},{"date":"Wed Oct 12 22:48:53 2011 UTC","comments":"Personally I don&#39;t feel inclined to look at &quot;jailbait&quot; pictures - it does nothing for me. Yet I also feel nothing against people who want to see it. When it comes to the question of right and wrong, the first thing I ask myself is: &quot;is anyone harmed by this?&quot; which is meant to different from the question of &quot;is anyone offended by this?&quot;\nIn specific case of &quot;looking at picture&quot;, I don&#39;t see any harm done. There may be harm to child only if the child is forced into modeling or doing sexually suggestive acts for camera man. If that&#39;s not the case, then there&#39;s nothing wrong with it.\nIt&#39;s very easy to say that things that you don&#39;t like are wrong and therefore others should be banned from doing them. That is why we have so many problems in the world with racial and sexual discrimination, marijuana laws. So many problems come out when we let personal preferences define our laws.","author":"Fig1024"},{"date":"Thu Oct 13 00:01:25 2011 UTC","comments":"So you don&#39;t think children having their image spread around a bunch of websites for adult men to jerk off to isn&#39;t detrimental to them? What happens if someone they know finds it? Or <em>they<\/em> find it? ","author":"haekledame"},{"date":"Thu Oct 13 13:43:58 2011 UTC","comments":"If you jerk off to a picture of Barack Obama, is it detrimental to him?","author":"Almalexia"},{"date":"Thu Oct 13 01:36:35 2011 UTC","comments":"if the image is not sexually suggestive, then there is no reason to think that people jerk off to it. Otherwise, same thing could be said of any picture you post on the internet, on Facebook or whatever. People can jerk off to anything, what does it matter?\nIf those people manage to get personal contact information and start harassing the person in picture, then it&#39;s clearly wrong and there are rules against such behavior.","author":"Fig1024"},{"date":"Thu Oct 13 00:13:28 2011 UTC","comments":"You mean like 500 of their friends when they put it in Facebook","author":"EbayNachos"},{"date":"Thu Oct 13 09:30:43 2011 UTC","comments":"Exactly! I see the same photos posted by my relative&#39;s kids on a daily basis. I looked at /jailbait when this first was brought to attention. I&#39;ve seen much worse posted on FB. Why aren&#39;t these kid&#39;s parents monitoring what their kids post in the first place. I&#39;m a mom and my kids aren&#39;t allowed to post pics online. ","author":"Luvutoo"},{"date":"Thu Oct 13 13:43:23 2011 UTC","comments":"And most of the pics on jailbait were just myspace shots and stuff you would see on facebook anyway.","author":"Almalexia"},{"date":"Thu Oct 13 00:19:30 2011 UTC","comments":"A new section called Anderson Cooper Jailbait has opened up, where pedophiles photoshop Cooper&#39;s head on to the bodies of underaged girls in suggestive poses. There are hundreds and hundreds of them already. I&#39;m not going to link to any pictures, mostly because seeing them once was way more than I can handle at this point. I&#39;ve seen some pretty hosed up things in my time here, but a hundred pictures of Anderson Cooper crossed with 12 year olds in bikinis like an infinitely creepier Windowlicker is pretty much at the top.\nReddit makes me proud.","author":"th1nker"},{"date":"Thu Oct 13 06:17:29 2011 UTC","comments":"Good. It removed a subreddit dedicated to pedophiles. ","author":"MenorahMan"},{"date":"Wed Oct 12 23:43:05 2011 UTC","comments":"This is a good thing, so I don&#39;t understand why the title seems to read like some sort of weird defeat..","author":"Choochoocazoo"},{"date":"Thu Oct 13 01:08:26 2011 UTC","comments":"<a href=\"http://i.imgur.com/Ro6D8.png\">Crusader Complex<\/a>","author":"pretzelzetzel"},{"date":"Thu Oct 13 04:30:52 2011 UTC","comments":"His avatar is a Feynman diagram.  Your argument is invalid.","author":"you_le_i_downvote"},{"date":"Thu Oct 13 08:04:42 2011 UTC","comments":"And in the meantime, everyone who said that Reddit was overreacting, causing a Streisand effect, and that this would bite us in the ass got downmodded for their troubles.\nYes, I AM fucking saying &#39;I told you so.&#39;  Next time someone in the media says something about Reddit you don&#39;t like, USE YOUR DAMN BRAINS rather than running around screaming like a 4 year old having a tantrum.  You only made yourselves a target.\nAlthough, Voltaire aside, I can&#39;t say I&#39;ll shed any tears over that cesspit being taken down.  At least this will improve Reddit&#39;s image, in the end.","author":"APeacefulWarrior"},{"date":"Thu Oct 13 18:28:39 2011 UTC","comments":"Two internet groups angry at each other... How cute.","author":"midnitebr"},{"date":"Thu Oct 13 01:01:08 2011 UTC","comments":"Frankly I am glad it is down, some of that shit was disgusting. As far as somethingaweful being some sort of a fantastic site...","author":"satsujin_akujo"},{"date":"Wed Oct 12 20:31:23 2011 UTC","comments":"Personally I don&#39;t give a fuck if people use reddit to fap to.  If there were some hardcore cp pics going on, I&#39;m pretty sure they would have been removed.  This is an example of some group feeling way more justified than they should in shutting down a small portion of free speech.  If it is posted to the web, it is public information.  Period.  &quot;OH NOES THE PIX I PoSTD TO FACEBOOKS IS ON REDDIT NOW OMGz SUEZ THEM AND SHUTS IT ALL DOWNZ!!!!!&quot;","author":"FunnyUpvoteForYou"},{"date":"Wed Oct 12 21:39:30 2011 UTC","comments":"Free speech does not apply to private corporations such as Reddit or Conde Nast.","author":"Thinglingson"},{"date":"Wed Oct 12 22:39:49 2011 UTC","comments":"It does when Reddit claims to be a free speech website.","author":"memeofconsciousness"},{"date":"Wed Oct 12 22:55:38 2011 UTC","comments":"When was this claimed?","author":"Thinglingson"},{"date":"Wed Oct 12 23:10:51 2011 UTC","comments":"Reddit general manager Erik Martin:\n&quot;There&#39;s stuff on there that&#39;s extremely offensive and reprehensible. but we&#39;re not an editorial site. If something&#39;s legal we don&#39;t touch it.&quot;\nThis was his response after the initial Anderson Cooper expose. <a href=\"http://gawker.com/erik-martin/\">http://gawker.com/erik-martin/<\/a> (be warned its Gawker)<a href=\"http://www.youtube.com/watch?feature=player_embedded&amp;v=HxBBiJ_sL60#!\">video interview<\/a>","author":"memeofconsciousness"},{"date":"Wed Oct 12 22:49:27 2011 UTC","comments":"I feel less intelligent for having read through that SA thread.\nIs this indicative of their content?","author":"LessLikeYou"},{"date":"Thu Oct 13 02:26:36 2011 UTC","comments":"Obligatory: you cherry‐picked a poor definition.","author":"BrowsOfSteel"},{"date":"Wed Oct 12 22:27:21 2011 UTC","comments":"At least all the people on Reddit who think that they&#39;re &#39;forever alone&#39; can feel better about themselves... you don&#39;t pay to use forums :)","author":"Smetsnaz"},{"date":"Wed Oct 12 23:35:09 2011 UTC","comments":"And my God does it show. ","author":"CWalker00"},{"date":"Thu Oct 13 04:02:44 2011 UTC","comments":"Well, it&#39;s really just a bunch of people that are willing to pay :10bux: to use a forum.  If SA is better than any other internet community it&#39;s probably because of the fee.  While it&#39;s not a lot of money, the forums are moderated pretty well and being a giant asshat will eventually get costly to maintain.","author":"McPantaloons"},{"date":"Thu Oct 13 05:33:42 2011 UTC","comments":"I&#39;ve put probably 30$ into my SA account over the course of 5 years and I do not regret it in the slightest. I&#39;ve <em>easily<\/em> saved over 100$ by purchasing things through SA-Mart (A private forum for members only to buy/sell goods.). I&#39;ve made decisions on large purchases in the past few years (TV, Tablet Computer, hell, even my office chair) based on recommendations and reviews from Goons, and I can&#39;t think of a single complaint about any of them. Goons look out for Goons. It sounds stupid, but it&#39;s entirely true.\nPlus, as someone else said, it keeps shitty content, and shitty posters, out of the forums. ","author":"dnalloheoj"},{"date":"Thu Oct 13 06:30:44 2011 UTC","comments":"someone has to pay for lowtax&#39;s child support","author":"ActuallyAnAlpaca"},{"date":"Thu Oct 13 01:45:08 2011 UTC","comments":"Imagine the quality improvement reddit would have if there was a small barrier to entry.  I can only dream.","author":"puppymeat"},{"date":"Thu Oct 13 05:30:01 2011 UTC","comments":"I too have thought about this. Even 50 cents would probably filter out a lot of the idiots.","author":"mr_jim_lahey"},{"date":"Wed Oct 12 22:23:07 2011 UTC","comments":"I&#39;m all for shutting down pedophiles, and if <a href=\"/r/jailbait\">r/jailbait<\/a> was used for distributing child porn then good riddance.\nI am, however, not for calling ephebophiles pedophiles.If the victim is not pre-pubescent, then the offender is not a pedophile. (Note that this does not change whether something okay or not, it&#39;s just the distinction that is important)","author":"Karzul"},{"date":"Thu Oct 13 01:47:22 2011 UTC","comments":"I wanna thank them.","author":"songcharts"},{"date":"Wed Oct 12 20:18:30 2011 UTC","comments":"Jailbait was using the proverbial &quot;line&quot; as a skipping rope. I doubt the vast majority of it&#39;s viewers were of the same age of those being pictured and even those most adamant of it&#39;s legality know deep down inside the purpose of those images. \nAccept this and move on.","author":"Idownvotecatpictures"},{"date":"Wed Oct 12 23:49:26 2011 UTC","comments":"There are a lot of retards in that SA thread. <a href=\"/r/gonewild\">/r/gonewild<\/a> is apparently pedophilia as well, according to some.\nI thought <a href=\"/r/jailbait\">/r/jailbait<\/a> was gross, but I fear this sets a bad precedent.","author":"lncontheivable"},{"date":"Thu Oct 13 01:39:03 2011 UTC","comments":"Good shut it down, I don&#39;t want my favourite website associated with this creepy shit..","author":"username_666"},{"date":"Thu Oct 13 01:50:54 2011 UTC","comments":"you have 666 in your name...","author":"Srkillzalot"},{"date":"Thu Oct 13 00:39:05 2011 UTC","comments":"What point are you making here?\nYou&#39;d have to actively seek out the content there to view it. ","author":"opmike"},{"date":"Thu Oct 13 00:32:04 2011 UTC","comments":"Then fucking don&#39;t. I like looking at nice tits and ass. Some girls who are 17 have very nice tits and ass. I don&#39;t give a fuck that there&#39;s some arbitrary number which makes them &quot;underage&quot; or whatever. I like beautiful women of all ages.","author":"BabyWookie"},{"date":"Thu Oct 13 16:25:28 2011 UTC","comments":"If you don&#39;t want strangers too look at your picture, don&#39;t post it on the Internet. As been proven over and over, privacy settings are a joke. There is also a pretty good change that, no matter what you post, it will turn some pervert on and he will jerk off to it. There is probably someone who jerked off to pictures of your cat, your power tools, your car and your kid. ","author":"BabyWookie"},{"date":"Thu Oct 13 06:55:07 2011 UTC","comments":"If the photos are already public, go for it. It&#39;s distributing photos without consent that I don&#39;t agree with. Like the 14 year old ass that got this whole thing started.","author":"Hindu_Wardrobe"},{"date":"Thu Oct 13 16:26:33 2011 UTC","comments":"It&#39;s a good idea to assume that anything you post on Facebook, Flickr, the proverbial &quot;cloud&quot;, etc is automatically public.","author":"BabyWookie"},{"date":"Thu Oct 13 16:28:51 2011 UTC","comments":"Oh, absolutely. I have 16 year olds as friends on facebook (I know... I&#39;m 19 myself, however) and their photos could very well be jailbait material. That&#39;s their prerogative to put those pics up. Nothin&#39; wrong with that. I&#39;m just saying photos like nudes sent to someone you trusted... and they turn around and put them on the internet. I don&#39;t care to debate the morality of it and whose fault it is, my point is that breaking trust like that is just a dick move. Surely we can agree with that.","author":"Hindu_Wardrobe"},{"date":"Thu Oct 13 00:20:15 2011 UTC","comments":"Good, don&#39;t look then.","author":"jedberg"},{"date":"Thu Oct 13 00:44:32 2011 UTC","comments":"No, I tell them to file a copyright complaint.","author":"jedberg"},{"date":"Thu Oct 13 01:11:08 2011 UTC","comments":"This may be the first time I&#39;ve ever seen one of jedberg&#39;s comments at a negative score.","author":"KerrickLong"},{"date":"Fri Oct 14 02:26:56 2011 UTC","comments":"hahahahaaaa\nyes, all teenage girls have the ability to file copyright complaints. it worked so well for angie verona!","author":"Drdongsmd"},{"date":"Thu Oct 13 01:19:03 2011 UTC","comments":"99% of the content in that reddit violated US copyright law. A large part could also probably have been classified as harassment.\nOk, but no one ever reported it.  reddit can not proactively enforce those things or they lose their common carrier protections.<blockquote>\nWhat that means in practice is that reddit is largely making money from peoples illegal activity.\nFirst off, that one reddit did not represent much of reddit&#39;s overall traffic.  In that light, you could say the same thing about any ISP -- that they are making money off of people&#39;s illegal activities, because some people use their ISP to download movies and music illegally.\nThat&#39;s the whole point of common carrier.  It protects people who provide platforms for the exchange of information from having to police that information.","author":"jedberg"},{"date":"Thu Oct 13 00:50:53 2011 UTC","comments":"So reddit got all riled up by a third party trolling them into reducing their liberties because of scaremongering and moral manipulation.  Where have I seen this happen before?","author":"vengeance64"},{"date":"Thu Oct 13 12:40:00 2011 UTC","comments":"This is why I love SA with all my heart.","author":"FuckingJerk"},{"date":"Thu Oct 13 02:05:18 2011 UTC","comments":"i&#39;m fine with that subreddit being shut down. it&#39;s fucking disgusting.","author":"carnivoris"},{"date":"Wed Oct 12 21:48:56 2011 UTC","comments":"Maybe I&#39;m just not seeing the whole picture here, but why would adult men (and forgive me for assuming some of you are adults) even <em>want<\/em> to look at pictures of scantily-clad underage girls when there are thousands of pictures of scantily-clad adult women available?","author":"foxymoron"},{"date":"Wed Oct 12 23:10:55 2011 UTC","comments":"Because 18 years olds are considered adult men, and are attracted to woman around their age, including a few years younger?","author":"psyon"},{"date":"Wed Oct 12 23:53:28 2011 UTC","comments":"Yeah because that&#39;s what the entire subreddit was about.  18 year olds looking at 17 year olds.","author":"terriblecomic"},{"date":"Thu Oct 13 00:43:29 2011 UTC","comments":"You didn&#39;t askwhat <a href=\"/r/jailbait\">r/jailbait<\/a> was about, you asked why adult men would event <em>want<\/em> to look at underage girls.  That is why.","author":"psyon"},{"date":"Thu Oct 13 03:09:31 2011 UTC","comments":"because <a href=\"http://i.imgur.com/uKVB3.png\" rel=\"nofollow\">this<\/a>","author":"wolfsktaag"},{"date":"Thu Oct 13 03:15:13 2011 UTC","comments":"That might cost you a fair bit.","author":"kineticreality"},{"date":"Thu Oct 13 06:33:43 2011 UTC","comments":"So I went to the somethingaweful forums and looked around. It looks like a pretty good site. I read quite a few interesting things. Thought I&#39;d sign up. IT COSTS MONEY!. So now I&#39;m back at reddit. ","author":"adrianrain"},{"date":"Thu Oct 13 01:52:52 2011 UTC","comments":"Could you explain to me what your understanding of jailbait is?","author":"Davdak"},{"date":"Wed Oct 12 23:32:53 2011 UTC","comments":"Well fuck, let&#39;s open that shit back up!","author":"pancakeChef"},{"date":"Thu Oct 13 00:21:49 2011 UTC","comments":"somethingawful: for people stupid enough to pay for an internet forum","author":"c_mulk"},{"date":"Thu Oct 13 00:22:54 2011 UTC","comments":"Reddit gold.","author":"mageling"},{"date":"Thu Oct 13 00:23:32 2011 UTC","comments":"Reddit gold.","author":"mageling"},{"date":"Thu Oct 13 00:20:08 2011 UTC","comments":"I just like saying &quot;Goon raid&quot;.","author":"F-Stop"},{"date":"Thu Oct 13 01:17:49 2011 UTC","comments":"It&#39;s probably a good thing jb is gone, but this is a pretty good example of how fragile reddit is (with its low % of voters) to &quot;attacks&quot; from other, somewhat decently organized communities. I remember a white supremacist agenda being revealed, advertising blocks aren&#39;t uncommon to see, what else?","author":"Snargs"},{"date":"Wed Oct 12 22:40:43 2011 UTC","comments":"Or they are just taking credit for shit that happened.","author":"Lots42"},{"date":"Thu Oct 13 02:36:06 2011 UTC","comments":"btw, <a href=\"/r/asianjailbait\" rel=\"nofollow\">r/asianjailbait<\/a> is still up. I guess all the caucASIAN pics could be posted there too :p","author":"M1ntBerryCrunch"},{"date":"Thu Oct 13 13:33:42 2011 UTC","comments":"Haha, awesome job, Goons.","author":"Zentraedi"}]